{"course_name":"PORT 101","subject_code":"PORT","course_number":"101","course_title":"First-Year Portuguese I","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=PORT&course=101&sessyr=2020&sesscd=W","sections":{"101":{"status":" ","section":"PORT 101 101","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=PORT&course=101&section=101&sessyr=2020&sesscd=W","activity":"Web-Oriented Course","term":"1","interval":"","days":" Mon Wed Fri","start":"9:00","end":"10:00","comments":"First-Year Portuguese I PORT 101 is a culture-oriented and interactive introduction to Portuguese language. The rich cultures of Brazil and Portugal are incorporated in all the materials used in class, providing students with an opportunity to immerse in authentic sociocultural situations. Students participate in communicative activities that will help them develop listening, speaking, reading and writing skills. These activities include role-play, group tasks; writing texts of practical nature, such as e-mails, tweets and short compositions; reading and talking about simple articles on topics of interest; playing trivia games; watching and talking about movies, short clips and music videos. Upon successful completion of the course, students will be able to sustain communication about ev and ~eryday life situations, such as introductions, campus life, expressing personal interests and hobbies, asking for information, ordering food, etc.Required text:Clémence de Jouët-Pastré, Anna Klobucka, et al., Ponto de Encontro: Portuguese as a World Language package, 2nd Edition, Pearson Canada, 2013. (Ponto de Encontro package includes: Ponto de Encontro textbook [Brazilian Portuguese] and MyPortugueseLab [24 months access]. This textbook package is used in PORT 101, 102, 201 and 202)","subject_code":"PORT","course_number":"101","section_number":"101","building":" ","room":"","instructors":["DOS SANTOS, PEDRO"],"totalRemaining":"16","currentlyRegistered":"19","generalRemaining":"16","restrictedRemaining":"0"},"102":{"status":" ","section":"PORT 101 102","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=PORT&course=101&section=102&sessyr=2020&sesscd=W","activity":"Web-Oriented Course","term":"1","interval":"","days":" Tue Thu","start":"12:30","end":"14:00","comments":"First-Year Portuguese IPORT 101 is a culture-oriented and interactive introduction to Portuguese language. The rich cultures of Brazil and Portugal are incorporated in all the materials used in class, providing students with an opportunity to immerse in authentic sociocultural situations. Students participate in communicative activities that will help them develop listening, speaking, reading and writing skills. These activities include role-play, group tasks; writing texts of practical nature, such as e-mails, tweets and short compositions; reading and talking about simple articles on topics of interest; playing trivia games; watching and talking about movies, short clips and music videos. Upon successful completion of the course, students will be able to sustain communication about everyday life situations,  and ~such as introductions, campus life, expressing personal interests and hobbies, asking for information, ordering food, etc.Required text:Clémence de Jouët-Pastré, Anna Klobucka, et al., Ponto de Encontro: Portuguese as a World Language package, 2nd Edition, Pearson Canada, 2013. (Ponto de Encontro package includes: Ponto de Encontro textbook [Brazilian Portuguese] and MyPortugueseLab [24 months access]. This textbook package is used in PORT 101, 102, 201 and 202)","subject_code":"PORT","course_number":"101","section_number":"102","building":" ","room":"","instructors":["DOS SANTOS, PEDRO"],"totalRemaining":"8","currentlyRegistered":"27","generalRemaining":"8","restrictedRemaining":"0"}},"credits":"Credits: 3","description":"Grammar, composition, translation, oral practice. Credit will be granted for only one of PORT 101 or PORT 110."}
