{"course_name":"ITAL 201","subject_code":"ITAL","course_number":"201","course_title":"Elementary Italian I","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=ITAL&course=201&sessyr=2020&sesscd=W","sections":{"101":{"status":" ","section":"ITAL 201 101","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ITAL&course=201&section=101&sessyr=2020&sesscd=W","activity":"Web-Oriented Course","term":"1","interval":"","days":" Mon Wed Fri","start":"10:00","end":"11:00","comments":"Reading, writing and oral practice, with constant and systematic reference to the grammatical structure of the language. Full description: https://fhis.ubc.ca/course-description/ital201/","subject_code":"ITAL","course_number":"201","section_number":"101","building":" ","room":"","instructors":["ZAMPIERI, ELENA"],"totalRemaining":"7","currentlyRegistered":"28","generalRemaining":"7","restrictedRemaining":"0"},"102":{"status":" ","section":"ITAL 201 102","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ITAL&course=201&section=102&sessyr=2020&sesscd=W","activity":"Web-Oriented Course","term":"1","interval":"","days":" Mon Wed Fri","start":"11:00","end":"12:00","comments":"Second-Year Italian IThe primary aim of the courses is to consolidate students\u0019 oral and written proficiency, to improve their reading and comprehension skills and to promote their awareness of Italian culture. To serve that purpose, the courses are complemented by an interactive approach to the review of the main Italian grammatical points, an introduction to and discussion on cultural topics, such as stereotypes on Italian people and on Italy, Italian society, Made in Italy, principles in Italian cuisine, sport and health. Both courses are based on the guidelines provided by the Common European Framework of Reference for Languages. In particular, upon successful completion of Italian 201 course, students \u001cunderstand sentences and frequently used expressions related to areas of most immediate relevance such and ~ as basic personal and family information, communicate in routine tasks and describe aspects of their background, immediate environment and matters of immediate need\u001d, and are working toward achieving the A2 language level.The various assessments and evaluation methods which include vocabulary and grammar tests, peer reading exercises, 2-stage oral exams, peer writing, blogs and group videos are tied to overall course goals and objectives and are meant to help the students assess their own progress in all four language skills and on their cultural competency as well. Students prepare the assigned material prior to coming to class and are also expected to complete the online exercises for additional practice and to further interactively their cultural competency. Grammar in class will be covered briefly in order to clarify concepts already studied by students on their own and tested to evaluate accuracy.All activities and class discussions are conducted in Italian.","subject_code":"ITAL","course_number":"201","section_number":"102","building":" ","room":"","instructors":["ZAMPIERI, ELENA"],"totalRemaining":"24","currentlyRegistered":"11","generalRemaining":"24","restrictedRemaining":"0"},"W01":{"status":" ","section":"ITAL 201 W01","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ITAL&course=201&section=W01&sessyr=2020&sesscd=W","activity":"Waiting List","term":"1","interval":"","days":" ","start":" ","end":" ","comments":"ITAL 201 W01 is a general waitlist for all ITAL 201 sections in Term 1.  Registering for this waitlist (W01) serves two purposes: 1) If space opens up in any section of this course, you will be notified and/or placed automatically in the open section (W01 -> Any Section);  2) If there is sufficient demand for an additional section of this course to be offered, you will be notified when an additional section is created. Full sections will at times be blocked for registration and waitlisted students will be transferred to sections on a priority basis.","subject_code":"ITAL","course_number":"201","section_number":"W01","building":"No Scheduled Meeting","room":"","instructors":["TBA"],"totalRemaining":"100","currentlyRegistered":"0","generalRemaining":"100","restrictedRemaining":"0"}},"credits":"Credits: 3","description":"Introduction to complex language structures used to communicate in a variety of situations by using different tenses and modes. Enhanced ability to comprehend, interact and express wishes or feelings in common personal and social contexts. Aligned with CEFR level A2 objectives.\n"}
