{"course_name":"PHIL 441","subject_code":"PHIL","course_number":"441","course_title":"Philosophy of Perception","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=PHIL&course=441&sessyr=2020&sesscd=W","sections":{"001":{"status":" ","section":"PHIL 441 001","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=PHIL&course=441&section=001&sessyr=2020&sesscd=W","activity":"Web-Oriented Course","term":"1","interval":"","days":" Mon Wed Fri","start":"9:00","end":"10:00","comments":"In this course, we will consider some of the main philosophical problems that arise in connection with perception, concentrating mainly on visual perception. What is perception? Do we encounter the world directly in perception, or is our perceptual access to the world mediated somehow? Is the concept of representation essential to any adequate account of perception?COVID-19 notice: The current plan is for class meetings to use a lecture/discussion format and to take place entirely online. Monday and Friday lectures will be recorded so that students living in distant time zones can view them during daylight hours. Wednesday class meetings will take place in real time on UBC Canvas Collaborate Ultra and will be used for class discussion, assessment (quizzes and exams), and student presentations.","subject_code":"PHIL","course_number":"441","section_number":"001","building":" ","room":"","instructors":["BITTNER, THOMAS JACOB"],"totalRemaining":"8","currentlyRegistered":"70","generalRemaining":"8","restrictedRemaining":"0"},"002":{"status":" ","section":"PHIL 441 002","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=PHIL&course=441&section=002&sessyr=2020&sesscd=W","activity":"Lecture","term":"2","interval":"","days":" Tue Thu","start":"9:30","end":"11:00","comments":"Course Description: We will consider some of the main philosophical problems that arise in connection with perception, concentrating mainly on visual perception. What is perception? What is the object of perception? Do we see the world directly, or is our perceptual access to the world mediated somehow? What role do sensation and consciousness play in perception? How is perception related to action and movement? Is the concept of representation essential to any adequate account of perception?In the philosophical tradition, the study of perception has been largely in service of problems in epistemology (the theory of knowledge). We will touch on some of these issues, but the emphasis in this course will, instead, be on perception itself as a topic in metaphysics and the philosophy of mind. This approach to the philosophy of perception makes it a less purely philosophical and slightly more interdisciplinary subject. In addition, at least two of our topics (the causal theory of perception and Molyneux's question) will give us the opportunity to reflect on the relationship between philosophical and scientific investigations of perception.","subject_code":"PHIL","course_number":"441","section_number":"002","building":"Chemistry","room":"C124","instructors":["AYDEDE, MURAT"],"totalRemaining":"31","currentlyRegistered":"49","generalRemaining":"31","restrictedRemaining":"0"}},"credits":"Credits: 3","description":"The contribution of the senses to knowledge of the external world; the nature of perception and its contribution to empirical knowledge."}
