{
  "course_name": "PHIL 551A",
  "subject_code": "PHIL",
  "course_number": "551A",
  "course_title": "Philosophy of Mind - PHIL OF MIND",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=PHIL&course=551A&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "PHIL 551A 002",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=PHIL&course=551A&section=002&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "2",
      "interval": "",
      "days": [
        "WED"
      ],
      "start": "14:00",
      "end": "17:00",
      "comments": "Permission is required to take this course for students who are not members of the Philosophy graduate program. Please e-mail Dr. Margolis for further information.What underlies our ability to acquire the rich and varied concepts that structure how we think about the world? Do human conceptual capacities largely trace back to a powerful form of general intelligence? Or do they depend in part on innate special-purpose psychological systems for thinking in specific types of ways? This seminar will explore the latter (nativist) approach to the origins of concepts. We will discuss different interpretations of the nativist position and how it relates to debates about nature-nurture and debates about what it might mean to say that a trait is innate. We will also examine a surprisingly large number of arguments that factor into the case for a nativist approach, while taking up a variety of important case studies (for example, the origins of such concepts and ~ as 'belief,' 'cause,' and 'number').COVID-19 notice: In the event that this course has to take place online, it will still be organized as a seminar with the usual focus on class discussion and student presentations, using Zoom or an equivalent video conference tool.",
      "subject_code": "PHIL",
      "course_number": "551A",
      "section_number": "002",
      "building": " ",
      "room": "",
      "instructors": [
        "MARGOLIS, ERIC"
      ],
      "totalRemaining": "14",
      "currentlyRegistered": "11",
      "generalRemaining": "14",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": " ",
  "terms": [
    "2"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
