{
  "course_name": "PHIL 337",
  "subject_code": "PHIL",
  "course_number": "337",
  "course_title": "Ethics for the Sciences ",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=PHIL&course=337&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "PHIL 337 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=PHIL&course=337&section=001&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "2",
      "interval": "",
      "days": [
        "MON",
        "WED"
      ],
      "start": "16:00",
      "end": "17:30",
      "comments": "Scientific research has an impact on all of us, and on every aspect of our lives. This course will provide a general introduction to ethics issues that are raised by the (non-medical) social and natural sciences. It is organized around three central questions: what counts as \u001cresponsible conduct of research\u001d (RCR)?; who is accountable for the social and environmental impacts of research?; and what role do social values play in scientific practice? This course is intended for students in the social and natural sciences, as well as in Philosophy. It has no prerequisites but if you have taken ISCI 433 you cannot take this course for credit.Requirements include discussion posts, in-class participation and quizzes (40%), a group presentation (10%), two short essays (25%), and a final exam (25%).This course will meet remotely, using the Canvas online meeting functions. Discussion is an important  component of this class, so students are encouraged to attend synchronously. However, class lectures (primarily on Mondays) will be recorded when presented and made available for viewing asynchronously. Group presentations by students (primarily on Wednesdays) will be recorded as well if presented synchronously in class, although presenting groups will have the option of recording them in advance for asynchronous viewing. Discussion sessions will be built into both weekly class meetings and supplemented by online discussion posts. Please contact the instructor to explore asynchronous options if synchronous attendance will be difficult.",
      "subject_code": "PHIL",
      "course_number": "337",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "WYLIE, ALISON"
      ],
      "totalRemaining": "71",
      "currentlyRegistered": "19",
      "generalRemaining": "71",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": "Philosophical exploration of ethical issues in the non-medical sciences, including topics such as intellectual integrity, responsible conduct of research, protection of human subjects, ethics of animal experimentation, and the social responsibilities of scientists. Credit will be granted for only one of ISCI 433 or PHIL 337.",
  "terms": [
    "2"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
