{"course_name":"PHIL 419A","subject_code":"PHIL","course_number":"419A","course_title":"Philosophy of History - PHIL OF HISTORY","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=PHIL&course=419A&sessyr=2020&sesscd=W","sections":{"001":{"status":" ","section":"PHIL 419A 001","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=PHIL&course=419A&section=001&sessyr=2020&sesscd=W","activity":"Seminar","term":"2","interval":"","days":" Tue Thu","start":"15:30","end":"17:00","comments":"How do we know what (we think) we know about the past?  What makes an historical narrative explanatory? And why does history matter? These questions about historical inquiry have long intrigued philosophers and practitioners alike. We will focus on evidential reasoning and narrative construction in history and archaeology, with some comparative examples drawn from the philosophy of geology, evolutionary biology and paleontology. Core texts will include Currie's \"Rock, Bone and Ruin: An Optimist's Guide to the Historical Sciences\" (2018); Chapman and Wylie's \"Evidential Reasoning in Archaeology\" (2016); Roth's \"Philosophical Structure of Historical Explanation\" (2020); and Trouillot's \"Silencing the Past\" (1995). Requirements: short weekly response posts and in-class presentations (50%);  and ~a short expository essay and a final term paper (50%). Prerequisites: no formal prerequisites but it is recommended that you have at least one prior course in an historical science and/or in philosophy of science. Contact the instructor if you have any questions about appropriate background for this course. Graduate credit: contact the instructor to arrange graduate-level requirements if you would like to register for 500-level credit. The request form for graduate credit must be approved before registration closes.","subject_code":"PHIL","course_number":"419A","section_number":"001","building":"Mathematics","room":"204","instructors":["WYLIE, ALISON"],"totalRemaining":"17","currentlyRegistered":"8","generalRemaining":"17","restrictedRemaining":"0"}},"credits":"Credits: 3","description":"Concepts of history and historical explanation, historical progress, purpose, necessity, law and causation. Hegel, Marx, Vico, Spengler, Pareto, Collingwood, Croce, and Toynbee, as well as contemporary figures. Students will be expected to have an adequate knowledge of ancient or modern history."}
