{
  "course_name": "PHIL 491",
  "subject_code": "PHIL",
  "course_number": "491",
  "course_title": "Seminar for Majors in Philosophy",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=PHIL&course=491&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": "Full",
      "section": "PHIL 491 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=PHIL&course=491&section=001&sessyr=2020&sesscd=W",
      "activity": "Seminar",
      "term": "1",
      "interval": "",
      "days": [
        "WED"
      ],
      "start": "14:00",
      "end": "17:00",
      "comments": "Course Description: Times are tough. A year ago, who would have foreseen that we would now be enduring a global pandemic? As of June 2020, nearly 400,000 people have died worldwide, while the livelihoods of billions of people have been disrupted. As I write these words, massive political protests against racism and police violence in the United States and the world beyond are underway. Meanwhile, we face an inescapable, planetary climate emergency. Biodiversity experts warn that it makes deadly disease outbreaks increasingly likely.You might think that philosophy is far removed from such upheavals. But philosophy is often born of crisis and responds to it. Crises can create opportunities to step back and think about how the world came to be the way it is and how it could be different. Although such thinking isn't limited to philosophy, it needs philosophy.The aim of this course is to draw from philosophy and literature to help us think about what we're going through and how we can choose to respond to it.COVID-19 notice: This course will be delivered asynchronously through Canvas. This means that there are no scheduled class meetings. Instead, the content will consist of assigned readings and corresponding short videos (20 minutes). I will hold office hours and drop-in discussion sessions several times a week, again remotely via Canvas.PHIL491 satisfies the Arts research requirement and is restricted to fourth-year philosophy majors. Other students require permission of the instructor.",
      "subject_code": "PHIL",
      "course_number": "491",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "THOMPSON, EVAN"
      ],
      "totalRemaining": "0",
      "currentlyRegistered": "25",
      "generalRemaining": "0",
      "restrictedRemaining": "0"
    },
    {
      "status": "Full",
      "section": "PHIL 491 002",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=PHIL&course=491&section=002&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "2",
      "interval": "",
      "days": [
        "WED"
      ],
      "start": "14:00",
      "end": "17:00",
      "comments": "PHIL491 satisfies the Arts research requirement and is restricted to fourth-year philosophy majors. Other students require permission of the instructor.'For Love of the World': this phrase was used by a biographer of Hannah Arendt to capture the particular flavour of this iconic political philosopher, whose work engaged more than most with the issues of the day. As someone who had lived through the horrors of WW2 and experienced a world menaced by the Nazi and Bolshevik regimes, she was concerned throughout her life to confront the threat that modern industrialized society posed to the foundations of a moral society. Looking back to the origins of democracy in ancient Greek society and the notion of the public sphere, she wrote passionately about the roots of totalitarianism in colonialism, systemic racism, and the moral and political dangers inherent in the loneliness and alienation of mass society. Her notion of the 'banality of evil' and ~ still generates controversy today.Because of the nature of a philosophy seminar, it is important to this course that students be able to participate in synchronous interactions during scheduled class time.  For most class meetings, I will post pre-recorded materials for part of the 3-hour block, which students can view asynchronously/ at their convenience ahead of time, reducing our synchronous meeting time to approximately 2 hours.  For the first and the last two class meetings, we shall be interacting synchronously for scheduled class time.",
      "subject_code": "PHIL",
      "course_number": "491",
      "section_number": "002",
      "building": "Buchanan",
      "room": "B302",
      "instructors": [
        "BERRYMAN, SYLVIA"
      ],
      "totalRemaining": "0",
      "currentlyRegistered": "25",
      "generalRemaining": "0",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": "Selected problems in philosophy, with attention to methods of research. Check with the department for specific topics. Primarily for fourth-year Philosophy Major students, but also open to Philosophy Honours.",
  "terms": [
    "1",
    "2"
  ],
  "activities": [
    "Seminar",
    "Web-Oriented Course"
  ]
}
