{
  "course_name": "PHIL 310",
  "subject_code": "PHIL",
  "course_number": "310",
  "course_title": "The Philosophy of Plato",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=PHIL&course=310&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "PHIL 310 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=PHIL&course=310&section=001&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "1",
      "interval": "",
      "days": [
        "MON",
        "WED",
        "FRI"
      ],
      "start": "11:00",
      "end": "12:00",
      "comments": "This course will introduce you to Plato's philosophy as he develops it in a number of dialogues: Euthyphro, Protagoras, Phaedo, and Republic. At the time Plato writes these dialogues, the lines between philosophy and other disciplines, such as rhetoric, natural science, and religious prophesy, are not clearly drawn. While part of Plato's project is to draw and defend precisely these boundaries, the dialogues themselves are a complicated blend of philosophical and dramatic elements. We will examine the interaction between these elements. Some of the more dramatic features we will consider are: the role of the dialectical setting in framing the conversation to come; Plato's characterizations of Socrates and of his interlocutors; and his use of myth. We will follow Plato's Socrates as he se and ~eks to answer a variety of philosophical questions: What is the nature of the divine?; Is philosophy a form of rhetoric?; Are we immortal?; How does one become a morally good person?; What reasons does one have to want to be a good person? As we will see, Plato's distinctive formulations of these questions are of as much philosophical interest as his answers.COVID-19 notice: Please note that students will be expected to participate in one hour of synchronous instruction per week. All remaining elements of instruction will be asynchronous, except for office hours.",
      "subject_code": "PHIL",
      "course_number": "310",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "SOMMERVILLE, BROOKS"
      ],
      "totalRemaining": "5",
      "currentlyRegistered": "85",
      "generalRemaining": "5",
      "restrictedRemaining": "0"
    }
  ],
  "credits": "Credits: 3",
  "description": "A study of Plato's dialogues and his influence on subsequent philosophy.",
  "terms": [
    "1"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
