{
  "course_name": "PHIL 431",
  "subject_code": "PHIL",
  "course_number": "431",
  "course_title": "Topics in Social and Political Philosophy",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=PHIL&course=431&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": "Full",
      "section": "PHIL 431 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=PHIL&course=431&section=001&sessyr=2020&sesscd=W",
      "activity": "Seminar",
      "term": "1",
      "interval": "",
      "days": [
        "TUE"
      ],
      "start": "14:00",
      "end": "17:00",
      "comments": "This course will focus on two distinct but related topics in social/political philosophy: the nature, significance, and role of solidarity in society and politics; and the problem of complicity, which we may say involves acting for purposes that are benign or laudable but doing so in league with others whose larger interests are at odds with one's own, and possibly quite bad. Both concepts are difficult and deserve sustained attention, but the combination of them shows some deeper tensions in how to think about the pros and cons of acting collectively.COVID-19 notice: This course will be taught entirely online. Online lectures will be posted to the course's Canvas page early each week. During the scheduled meeting time, students will be expected to participate in a discussion section, perhaps every week, perhaps every other week, that will last 30-90 minutes, depending on the topic and week. For students who are living in time zones for which it is not feasible to appear in real time during the scheduled meeting time, I will endeavor to schedule alternative student discussion group times that allow those in that group to meet simultaneously at a different time, either once a week or perhaps every other week. Students will be expected to meet and work less formally in smaller groups of peers at various times over the semester to develo and ~p presentations to be recorded or written, and shared with other students in the seminar. Organizing such meetings to prepare presentations will be done by the students at times when all are able to participate.",
      "subject_code": "PHIL",
      "course_number": "431",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "ANDERSON, SCOTT ALLEN"
      ],
      "totalRemaining": "0",
      "currentlyRegistered": "25",
      "generalRemaining": "0",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": "Central concepts and problems in political life and thought including obligation, citizenship, representation, justice; equality; civil rights and liberty; disobedience.",
  "terms": [
    "1"
  ],
  "activities": [
    "Seminar"
  ]
}
