{
  "course_name": "PHIL 362",
  "subject_code": "PHIL",
  "course_number": "362",
  "course_title": "History and Philosophy of Economics from Aristotle to Adam Smith",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=PHIL&course=362&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "PHIL 362 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=PHIL&course=362&section=001&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "1",
      "interval": "",
      "days": [
        "TUE",
        "THU"
      ],
      "start": "15:30",
      "end": "17:00",
      "comments": "This course is cross-listed with ECON 318 001. Students can register in either section. We will trace the development of economic thought from Aristotle to Malthus, also reading brief excerpts from the work of Aquinas, Mun, Locke, and Quesnay. We will read, in more depth, the writings of David Hume and Adam Smith, and acquire a broader context from Albert O. Hirschman's account of the philosophical justification for capitalism. Our focus will be on the conceptual foundations of economics, particularly the problems of value, distribution, and economic growth, as well as the ethical dimensions of commerce.A note on course delivery from Dr. Schabas: I will record each lecture and also post the lecture notes on Canvas. I will lecture for about an hour in synchronous time, Tuesday and Thursday from 3:30 - 4:30. There will be a 5-minute break, and I will then lead discussion sections for the remaining 15 minutes, starting in the second week. Some weeks, as noted, do not have discussion meet-ups, and, in that case, I will lecture for the full 80 minutes. The class will be broken into four groups, and students are to attend their assigned discussion group. Two of these groups will be held in non-synchronous blocks of time to accommodate students in other time zones -- most likely on Friday or the following Monday. The midterm test and final exam will be issued as take-homes with a 24-hour windo and ~w to complete.Lecture live in the appointed time slot (TR 3:30 to 5PM), and 4 discussions sections of 15 minutes (20 student/class), including some Friday morning so that students in distant places could attend.  The lectures will be recorded.To not exceed the contact time for students (3 hours), I stop the Thursday lecture early, at 4:30 and after a short break move directly to discussions sections.",
      "subject_code": "PHIL",
      "course_number": "362",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "SCHABAS, MARGARET"
      ],
      "totalRemaining": "14",
      "currentlyRegistered": "31",
      "generalRemaining": "14",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": "The development of economic thought from Aristotle to Adam Smith, focusing primarily on the conceptual foundations of economics, particularly the problems of value, distribution, and economic growth.",
  "terms": [
    "1"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
