{
  "course_name": "PHIL 369A",
  "subject_code": "PHIL",
  "course_number": "369A",
  "course_title": "Philosophy of Science - PHIL OF SCIENCE",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=PHIL&course=369A&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "PHIL 369A 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=PHIL&course=369A&section=001&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "1",
      "interval": "",
      "days": [
        "MON",
        "WED",
        "FRI"
      ],
      "start": "10:00",
      "end": "11:00",
      "comments": "Course Description: This course is an introduction to some of the major concepts and issues in contemporary philosophy of science.  The orientation of the course is primarily philosophical, rather than historical. The first part of the course is concerned with the nature of evidence and scientific knowledge. Our main topics in this part of the course are the problem of induction, objectivity and values in science, and the confirmation of scientific theories. The second part of the course focuses on broadly metaphysical themes: explanation and causation, laws of nature, and scientific realism. We conclude with a brief discussion of the role of thought experiments in science.COVID-19 notice: Lectures will take place live via Collaborate Ultra but will be recorded and posted for students who are unable to attend. Fully-synchronous course components include a final exam and an optional weekly tutorial.",
      "subject_code": "PHIL",
      "course_number": "369A",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "BARTHA, PAUL"
      ],
      "totalRemaining": "10",
      "currentlyRegistered": "30",
      "generalRemaining": "10",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": "Issues common to all sciences. Philosophical questions including the character of scientific laws, theories and revolutions, the nature of scientific confirmation, causality, explanation and prediction, and the use of logic and probability. Difficulties in the interpretation of atomic physics and questions about relationships between biology and psychology. No philosophical background is assumed. Credit will be granted for only one of PHIL 369 or PHIL 460.",
  "terms": [
    "1"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
