{
  "course_name": "PHIL 211",
  "subject_code": "PHIL",
  "course_number": "211",
  "course_title": "Greek Philosophy I: Socrates and Plato",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=PHIL&course=211&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "PHIL 211 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=PHIL&course=211&section=001&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "1",
      "interval": "",
      "days": [
        "MON",
        "WED",
        "FRI"
      ],
      "start": "13:00",
      "end": "14:00",
      "comments": "This course is crosslisted with CLST 211. If PHIL 211 001 is full, please register in CLST 211. It is the same course; the only difference is the course code.Course Description: This course traces the early evolution of Ancient Greek philosophy, or the \"love of wisdom\" (philosophia), from its roots in the myths of Homer (c. 800 BCE) to the dialogues of Plato (429-347 BCE). We focus on the search for self-knowledge, which Greek writers attributed to the Pythia, Oracle at Delphi. This thread will lead us to explore the powers attributed by the Pythia to the gods of Greek mythology, balanced by her emphasis on human freedom and responsibility. We'll find these Delphic themes shaping the mathematical and musical models of nature and human life developed by early Mediterranean scientists; through literary depictions of the Pythia's influence on early statecraft in Sparta and Athens; through the Socratic method of radical inquiry, inspired at Delph and ~i; and through the insights of women like Aristoclea of Delphi, Diotima of Mantinea, and Perictione of Athens, respectively recognized as teachers of Pythagoras, Socrates, and Plato, and as sources for several of their distinctive views -- self-examination, non-violence, sustainable local communities, gender equality in education and government, and the metaphysical theory of \"Forms\" or patterns underlying visible reality. These threads converge on Plato's depiction of Socratic self-cultivation, harmonizing rational inquiry and personal inspiration to seek the common interest of the individual and community: well-being. This course has no prerequisites.COVID-19 notice: This course will be held online. Each week, students are invited to attend at least one 50-minute, synchronous meeting online. Several alternative times will be made available, including one during the set calendar hour (13:00 - 14:00 PDT), and another keyed to timezone preferences. Synchronous attendance is optional but strongly encouraged. The platform for meetings will be determined closer to the term. Pre-recorded video lectures and additional readings will be posted weekly for review, supported by quizzes and group discussions, with guidance from the instructor and TAs. Discussions with the instructor, peers, reflective assignments, and drop-in office hours will also be available online.",
      "subject_code": "PHIL",
      "course_number": "211",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "GRIFFIN, MICHAEL"
      ],
      "totalRemaining": "2",
      "currentlyRegistered": "58",
      "generalRemaining": "2",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": "The Pre-Socratics; Socrates; Sophists; Plato.  Recommended as preparation for PHIL 310.",
  "terms": [
    "1"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
