{
  "course_name": "PHIL 321",
  "subject_code": "PHIL",
  "course_number": "321",
  "course_title": "Induction, Decision and Game Theory",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=PHIL&course=321&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "PHIL 321 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=PHIL&course=321&section=001&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "1",
      "interval": "",
      "days": [
        "MON",
        "WED",
        "FRI"
      ],
      "start": "12:00",
      "end": "13:00",
      "comments": "Course Description: There are two well-developed philosophical theories that try to characterize what it means to make choices rationally. One is decision theory, which considers the position of one agent choosing between several alternatives, with varying levels of information about factors that might influence the resulting outcomes. The other is game theory, which provides techniques for analyzing interactions among several rational agents. This course explains the fundamentals of these two theories and relevant background concepts such as probability and utility. We also explore paradoxical situations where the theories appear to clash with ordinary intuitions about rationality. We will consider applications throughout the course, with emphasis on social applications of game theory,  and ~and conclude with an introduction to evolutionary game theory and a discussion of Skyrms' book, \"Evolution of the Social Contract.\" Students who take this course should feel comfortable with technical work. Prior completion of PHIL 120, PHIL 125, PHIL 220, or any introductory-level course in mathematics, computer science, or economics is recommended.COVID-19 notice: Lectures will take place live via Collaborate Ultra but will be recorded and posted for students who are unable to attend. Synchronous course components include a midterm test, a final exam, and an optional weekly tutorial.",
      "subject_code": "PHIL",
      "course_number": "321",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "BARTHA, PAUL"
      ],
      "totalRemaining": "4",
      "currentlyRegistered": "71",
      "generalRemaining": "4",
      "restrictedRemaining": "0"
    }
  ],
  "credits": "Credits: 3",
  "description": "Formal methods relevant to probabilistic and inductive reasoning. Decision theory, game theory, axiomatic probability theory and its interpretations, belief dynamics, simulation and modelling.",
  "terms": [
    "1"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
