{"course_name":"CPSC 490","subject_code":"CPSC","course_number":"490","course_title":"Student Directed Seminars","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=CPSC&course=490&sessyr=2020&sesscd=W","sections":{"201":{"status":"Blocked","section":"CPSC 490 201","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=CPSC&course=490&section=201&sessyr=2020&sesscd=W","activity":"Seminar","term":"2","interval":"","days":" Mon","start":"15:00","end":"18:00","comments":"CPSC 490 201 - Pedagogy in Computer ScienceExamining how people learn computer science, what educators can do to improve both experience and outcomes, and practical applications of pedagogical academia. In-depth discussions of readings (research papers, textbook excerpts, etc.) on topics of interest. Hands-on practicum where students will curate a mini-curriculum on a computer science concept of their choice. Reflections and participation will count for the total mark. Students should also have at least six credits of CPSC in 200, 300, or 400-level courses. To register, please indicate your interest by completing both steps below:1) submitting the short survey at https://ubc.ca1.qualtrics.com/jfe/form/SV_79FXPvrXfwgvg9v2) registering in the waitlist. Students should also have at least 6 credits of CPSC 2xx/3xx before registering.The survey serves to gauge the applicant\u0019s interest in improving and understanding Computer Science education, and their participation in in-class discussions. Preference shall be given to 3rd and 4th year students, but students who do not meet this year standing are encouraged to apply regardless and fill out the survey to demonstrate their interest. We will notify you if you are successfully registered in the course. Session time is flexible, based on the availability of all participants.","subject_code":"CPSC","course_number":"490","section_number":"201","building":"Orchard Commons","room":"3052","instructors":["TBA"],"totalRemaining":"15","currentlyRegistered":"0","generalRemaining":"15","restrictedRemaining":"0"},"2W1":{"status":" ","section":"CPSC 490 2W1","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=CPSC&course=490&section=2W1&sessyr=2020&sesscd=W","activity":"Waiting List","term":"2","interval":"","days":" Mon","start":"15:00","end":"18:00","comments":"CPSC 490 2W1 - Pedagogy in Computer ScienceNot all students registering on the wait list will be admitted to the course. Registration in the course is limited to a maximum of 15 students. In late December, the best qualified students from the wait list will be registered into the actual  course.","subject_code":"CPSC","course_number":"490","section_number":"2W1","building":" ","room":"","instructors":["TBA"],"totalRemaining":"30","currentlyRegistered":"0","generalRemaining":"30","restrictedRemaining":"0"}},"credits":"Credits: 3","description":"Self-directed, collaborative studies, in a group-learning environment, initiated and coordinated by senior undergraduate students with the supervision of a faculty advisor. Course structure, enrolment and delivery methods will comply with the \"Handbook for Student Directed Seminars\"."}
