{
  "course_name": "ISCI 330A",
  "subject_code": "ISCI",
  "course_number": "330A",
  "course_title": "Topics in Integrated Sciences - TPCS INTEG SCIE",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=ISCI&course=330A&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "ISCI 330A 101",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ISCI&course=330A&section=101&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "1",
      "interval": "",
      "days": [
        "TUE",
        "THU"
      ],
      "start": "09:30",
      "end": "11:00",
      "comments": "Why the Big Brain? The Evolution of Human CognitionThis course will explore the origins and evolution of human cognition. What are the key defining features of cognition that humans excel at? How rapidly did they emerge in our history? What aspects do we consider to be exclusively human and what do we share with our hominid ancestors? Working our way through primate evolution (including non-human and fossil hominins), we will examine the major shifts that have occurred in the development of the \"Notable Neocortex\", the proposed selective pressures that are thought to have spurred these changes, and the physiological and behavioural outcomes that are projected to have resulted from these changes at different points in history. We will investigate evidence that combines the fields of biological anthropology, comparative biology, neuroscien and ~ce and evolutionary psychology, and ponder our contemporary cognition through an evolutionary lens - including the costs associated with carrying such a big brain.Please e-mail intsci@science.ubc.ca with registration questions about the course not the instructor.",
      "subject_code": "ISCI",
      "course_number": "330A",
      "section_number": "101",
      "building": " ",
      "room": "",
      "instructors": [
        "GABRIEL, DENISE"
      ],
      "totalRemaining": "14",
      "currentlyRegistered": "21",
      "generalRemaining": "10",
      "restrictedRemaining": "4"
    }
  ],
  "credits": 3,
  "description": "Interactive examination of a theme common to all areas of science. Themes will change from year to year. Priority to students in the Integrated Sciences Program.",
  "terms": [
    "1"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
