{"course_name":"ISCI 490","subject_code":"ISCI","course_number":"490","course_title":"Student Directed Seminars","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=ISCI&course=490&sessyr=2020&sesscd=W","sections":{"201":{"status":"Blocked","section":"ISCI 490 201","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ISCI&course=490&section=201&sessyr=2020&sesscd=W","activity":"Seminar","term":"2","interval":"","days":" Tue Thu","start":"16:00","end":"17:30","comments":"Although we know what we eat plays an important role in insulin resistance, research also suggests when we eat is just as important. This is the basic premise of intermittent fasting (IF), and there is a growing body of scientific evidence of its therapeutic potential. However, IF is often dismissed as a mere \u001cfad\u001d, and there are currently no courses at UBC that examine this exciting area of research. This course will explore intermittent fasting\u0019s rationale in improving insulin sensitivity and its therapeutic role in various health conditions, such as diabetes, obesity, cardiovascular diseases, and more. The course is designed for upper-level students with an interest in nutrition, physiology, and medicine. To apply, please send a statement of interest and academic background to kevin.ren@alumni.ubc.ca. **Disclaimer: this course is not designed to promote/give any specific medical advice.","subject_code":"ISCI","course_number":"490","section_number":"201","building":"Neville Scarfe","room":"100","instructors":["TBA"],"totalRemaining":"6","currentlyRegistered":"9","generalRemaining":"6","restrictedRemaining":"0"},"202":{"status":"Blocked","section":"ISCI 490 202","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ISCI&course=490&section=202&sessyr=2020&sesscd=W","activity":"Seminar","term":"2","interval":"","days":" Tue","start":"14:00","end":"17:00","comments":"Since the enforcement of widespread emergency response measures to control its outbreak in Spring 2020, COVID-19 has had an undeniably massive impact on society, and thus is an extremely, topical focus of study. The main goal of this course is to educate students on the systematic impact of scientific literature and its importance for making informed decisions within the context of COVID-19.  This course will be an outlet for students to practice science communication with weekly presentations, explore the scientific basis behind infamous COVID-19 phenomena along with the mastery of these concepts, which are becoming a favoured commodity in various aspects of science and medical careers such as academic research, coursework, future job and graduate school interviews and/or current occupational work.  A statement of interest is required, please send an email to a.chakrabarti@alumni.ubc.ca to register in the course","subject_code":"ISCI","course_number":"490","section_number":"202","building":"Buchanan","room":"B306","instructors":["TBA"],"totalRemaining":"15","currentlyRegistered":"0","generalRemaining":"15","restrictedRemaining":"0"}},"credits":"Credits: 3","description":"Self-directed, collaborative studies, in a group-learning environment, initiated and coordinated by senior undergraduate students with the supervision of a faculty advisor. Course structure, enrolment and delivery methods will comply with the Handbook for Student Directed Seminars."}
