{"course_name":"CHIN 463","subject_code":"CHIN","course_number":"463","course_title":"Early Classical Chinese Poetry (Han to Tang)","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=CHIN&course=463&sessyr=2020&sesscd=W","sections":{"001":{"status":"Blocked","section":"CHIN 463 001","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=CHIN&course=463&section=001&sessyr=2020&sesscd=W","activity":"Lecture","term":"2","interval":"","days":" Tue Thu","start":"17:00","end":"18:30","comments":"- PLACEMENT PROCEDURE: ALL students who wish to take ANY CHIN courses (or CLCH 389/399) are required to complete an \"On-Line Placement Questionnaire\" to obtain a placement approval for registration. Please only register for the course that you have approval for. To get your placement approval, please go to https://placement.asia.ubc.ca/ - For further information regarding CHIN courses, please go to http://www.chinese.arts.ubc.ca/front.htm- If this course is blocked please sign up for the waitlist section. Students will be placed into the class based off our department priority guidelines. For more information please visit: http://www.asia.ubc.ca/undergraduate/department-wait-lists/ (Is the class blocked even though there are a few seats that are free? This is normal. Please check our website for what this means.)UBC has not yet confirmed an approach for Term 2 courses. The meeting days and times currently displayed reflect the maximum time that students will be expected to meet synchronously with the instructor. Should the decision be made to offer Term 2 courses online, one or more of these times may be dropped or reduced and replaced with asynchronous learning tasks (similar to Term 1 sections). The overall workload of the course will remain unchanged. These details will be updated here as they become available.","subject_code":"CHIN","course_number":"463","section_number":"001","building":"Buchanan","room":"D222","instructors":["XU, XIAOWEN"],"totalRemaining":"0","currentlyRegistered":"60","generalRemaining":"0","restrictedRemaining":"0"},"W01":{"status":" ","section":"CHIN 463 W01","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=CHIN&course=463&section=W01&sessyr=2020&sesscd=W","activity":"Waiting List","term":"2","interval":"","days":" Tue Thu","start":"17:00","end":"18:30","comments":"Registering for this section does not mean you are enrolled in the course, this is a waitlist section. Students will be moved off the waitlist into the course automatically once there is space. For more information including our department priority guidelines please see: http://www.asia.ubc.ca/undergraduate/department-wait-lists/","subject_code":"CHIN","course_number":"463","section_number":"W01","building":" ","room":"","instructors":["XU, XIAOWEN"],"totalRemaining":"47","currentlyRegistered":"3","generalRemaining":"47","restrictedRemaining":"0"}},"credits":"Credits: 3","description":"Readings in classical poetry from the Six Dynasties to early Tang, at an advanced level. Not to be taken concurrently with any of the following CHIN 400-level language courses: CHIN 441/ 443/ 444/ 445/ 447/ 448/ 435/ 437. Credit will be granted for only one of CHIN 463 or CHIN 464."}
