{
  "course_name": "CHIN 437",
  "subject_code": "CHIN",
  "course_number": "437",
  "course_title": "Business Chinese II (Heritage)",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=CHIN&course=437&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": "Full",
      "section": "CHIN 437 002",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=CHIN&course=437&section=002&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "2",
      "interval": "",
      "days": [
        "THU"
      ],
      "start": "17:00",
      "end": "18:30",
      "comments": "-  PLACEMENT PROCEDURE: ALL students who wish to take ANY CHIN courses, (CNTO or CLCH 389/399) are required to complete an \"On-Line Placement Questionnaire\" to obtain a placement approval for registration. Please only register for the course that you have approval for. To get your placement approval, please go to https://placement.asia.ubc.ca/ - For further information regarding CHIN courses, please go to http://www.chinese.arts.ubc.ca/front.htmIf this course is blocked please sign up for the waitlist section. Students will be placed into the class based off our department priority guidelines. For more information please visit: http://www.asia.ubc.ca/undergraduate/department-wait-lists/ (Is the class blocked even though there are a few seats that are free? This is normal. Please check our website for what this means.)This course will be delivered in a mix-mode format (1.5 hrs synchronous + 1.5 hrs asynchronous). Students are expected to meet with the instructor synchronously for the sessions at the above listed days and times. Besides the synchronous meetings, the rest of the teaching will be delivered asynchronously and students are expected to complete on their own time. The total workload for this 3-credit course remains the same as a normal class that is delivered in-person.",
      "subject_code": "CHIN",
      "course_number": "437",
      "section_number": "002",
      "building": " ",
      "room": "",
      "instructors": [
        "LU, MING ZHU"
      ],
      "totalRemaining": "0",
      "currentlyRegistered": "30",
      "generalRemaining": "0",
      "restrictedRemaining": "0"
    },
    {
      "status": "Blocked",
      "section": "CHIN 437 W02",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=CHIN&course=437&section=W02&sessyr=2020&sesscd=W",
      "activity": "Waiting List",
      "term": "2",
      "interval": "",
      "days": [
        "THU"
      ],
      "start": "17:00",
      "end": "18:30",
      "comments": "Registering for this section does not mean you are enrolled in the course, this is a waitlist section. Students will be moved off the waitlist into the course automatically once there is space. For more information including our department priority guidelines please see: http://www.asia.ubc.ca/undergraduate/department-wait-lists/",
      "subject_code": "CHIN",
      "course_number": "437",
      "section_number": "W02",
      "building": "To Be Announced",
      "room": "",
      "instructors": [
        "LU, MING ZHU"
      ],
      "totalRemaining": "25",
      "currentlyRegistered": "0",
      "generalRemaining": "25",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": "Reading, writing, and presentation skills in business documentation, focusing on technical Chinese as used in the workplace. Emphasis on specialized vocabulary and development of communicative competence as relevant to legal and financial documents such as contracts, investments, and insurance. Credit will be granted for only one of CHIN 437 or CHIN 323.",
  "terms": [
    "2"
  ],
  "activities": [
    "Web-Oriented Course",
    "Waiting List"
  ]
}
