{
  "course_name": "SOCI 433D",
  "subject_code": "SOCI",
  "course_number": "433D",
  "course_title": "Directed Studies - STU DIRECTED SEM",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=SOCI&course=433D&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": "Blocked",
      "section": "SOCI 433D 201",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=SOCI&course=433D&section=201&sessyr=2020&sesscd=W",
      "activity": "Directed Studies",
      "term": "2",
      "interval": "",
      "days": [
        "WED"
      ],
      "start": "12:00",
      "end": "15:00",
      "comments": "CULTURAL SOCIOLOGY: This student-directed seminar will investigate the topic of culture in a sociological perspective. Cultural sociology examines beyond the current diluted notion of culture as the four f\u0019s: Food, Festival, Folklore, and Fashion, and further analyzes how these systems of orientation influence one\u0019s goal orientation, perception, and behavioral output in multiple frames of analyses. Furthermore, the seminar will investigate whether the multiculturalism that many Western societies attempt to achieve requires a metacultural system for multiple cultures to flourish and co-exist. To do this, students will explore both classic and contemporary theorists such as Durkheim, Weber, Bourdieu, Goffman, and other thinkers. By the end of this course, students will explain how differen and ~ces in core sociological institutions and memories of different cultures can lead to similarities and differences of socio-economic outcomes between cultural groups such as the Chinese, Germans, Japanese, and Jews, to understand the differences, disparities, and inequalities in contemporary multicultural societies such as Canada, USA, the UK, and so forth. Students who are interested should send a statement of intent including year of study, major, list of sociology courses you have taken so far, and reasons for interest to the Student Coordinator at hbdavidcho@alumni.ubc.ca",
      "subject_code": "SOCI",
      "course_number": "433D",
      "section_number": "201",
      "building": "Anthropology and Sociology",
      "room": "1305",
      "instructors": [
        "TBA"
      ],
      "totalRemaining": "14",
      "currentlyRegistered": "1",
      "generalRemaining": "14",
      "restrictedRemaining": "0"
    },
    {
      "status": "Blocked",
      "section": "SOCI 433D 202",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=SOCI&course=433D&section=202&sessyr=2020&sesscd=W",
      "activity": "Directed Studies",
      "term": "2",
      "interval": "",
      "days": [
        "MON"
      ],
      "start": "17:00",
      "end": "20:00",
      "comments": "Student Directed Seminar: SOCIOLOGY OF SOCIAL MEDIA - How are social media platforms, from Facebook to YouTube to TikTok, changing the world? In the past two decades, we have seen an explosive rise of various social media platforms that have greatly impacted society, shaping how race, gender, class, sexuality, ability, etc. can be conceptualized. As a dominant method for transmitting, fostering, and developing knowledge and culture, social media has dire effects on how we and the platforms themselves can exist as social agents. This seminar will explore how social media can be understood from a sociological lens, and how it might be applied to participants' everyday social media use. If you are interested in this course, please complete this survey:https://tinyurl.com/SDSsocialmedia",
      "subject_code": "SOCI",
      "course_number": "433D",
      "section_number": "202",
      "building": "Irving K Barber Learning Centre",
      "room": "157",
      "instructors": [
        "TBA"
      ],
      "totalRemaining": "10",
      "currentlyRegistered": "5",
      "generalRemaining": "10",
      "restrictedRemaining": "0"
    },
    {
      "status": "Blocked",
      "section": "SOCI 433D 203",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=SOCI&course=433D&section=203&sessyr=2020&sesscd=W",
      "activity": "Directed Studies",
      "term": "2",
      "interval": "",
      "days": [
        "WED",
        "FRI"
      ],
      "start": "12:00",
      "end": "13:30",
      "comments": "Student Directed Seminar: SUSTAINABILITY BEYOND BUZZWORDS - SOCIOPOLITICAL APPROACHES TO PROBLEMS IN SUSTAINABILITY - This section is cross-listed with POLI 351Z-001. This student-directed seminar combines sociological and political science perspectives to examine key issues in sustainability. It is organised around four modules: (1) Corporations  and  Technology, (2) Labour  and  Economy, (3) Food, Energy  and  Resources, and (4) Miscellaneous Special Topics. Some of the questions we will ask include: How do degrowth economies challenge capitalist systems of work and labour? Who can afford sustainability? How does climate change affect international migration and security? How effective is transnational corporate governance at encouraging global sustainable development? We will answer these questio and ~ns via facilitations, policy recommendations, and a real-life data-based policy project on sustainability. To register in this course, please fill out this form: https://bit.ly/3eFqmTg",
      "subject_code": "SOCI",
      "course_number": "433D",
      "section_number": "203",
      "building": " ",
      "room": "",
      "instructors": [
        "TBA"
      ],
      "totalRemaining": "11",
      "currentlyRegistered": "4",
      "generalRemaining": "11",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": "General reading and/or a research undertaking, with the agreement, and under the supervision, of a Department faculty member selected by the student.",
  "terms": [
    "2"
  ],
  "activities": [
    "Directed Studies"
  ]
}
