{"course_name":"ASIA 364A","subject_code":"ASIA","course_number":"364A","course_title":"Modern Japanese Literature in Translation - MOD JAPN LIT TRN","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=ASIA&course=364A&sessyr=2020&sesscd=W","sections":{"001":{"status":" ","section":"ASIA 364A 001","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ASIA&course=364A&section=001&sessyr=2020&sesscd=W","activity":"Web-Oriented Course","term":"1","interval":"","days":" Mon Wed Fri","start":"16:00","end":"17:00","comments":"If this course is blocked please sign up for the waitlist section. Students will be placed into the class based off our department priority guidelines. For more information please visit: http://www.asia.ubc.ca/undergraduate/department-wait-lists/ (Is the class blocked even though there are a few seats that are free? This is normal. Please check our website for what this means.)All course will be offered online in Term 1.  Instructors are currently adapting course content and determining the best delivery model for each course. Students can expect a variety of formats which may include a combination of online meetings and outside of class readings, recorded lecturers, and/or assignments, in various proportions. The meeting days and times currently displayed reflect the maximum time that students will be expected to meet synchronously with the instructor. One or more of these times may be dropped or reduced and replaced with asynchronous learning tasks. These details will updated here as they become available.","subject_code":"ASIA","course_number":"364A","section_number":"001","building":" ","room":"","instructors":["YI, CHRISTINA"],"totalRemaining":"4","currentlyRegistered":"51","generalRemaining":"4","restrictedRemaining":"0"},"W01":{"status":"Blocked","section":"ASIA 364A W01","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ASIA&course=364A&section=W01&sessyr=2020&sesscd=W","activity":"Waiting List","term":"1","interval":"","days":" Mon Wed Fri","start":"16:00","end":"17:00","comments":"Registering for this section does not mean you are enrolled in the course, this is a waitlist section. Students will be moved off the waitlist into the course automatically once there is space. For more information including our department priority guidelines please see: http://www.asia.ubc.ca/undergraduate/department-wait-lists/","subject_code":"ASIA","course_number":"364A","section_number":"W01","building":"To Be Announced","room":"","instructors":["YI, CHRISTINA"],"totalRemaining":"55","currentlyRegistered":"0","generalRemaining":"55","restrictedRemaining":"0"}},"credits":"Credits: 3","description":"An introduction to the literature and cultural history of modern Japan, with readings drawn from various literary genres, from 1868 to the present."}
