{"course_name":"ASIA 431","subject_code":"ASIA","course_number":"431","course_title":"Tibetan Literature, Genres, and Book Culture","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=ASIA&course=431&sessyr=2020&sesscd=W","sections":{"001":{"status":" ","section":"ASIA 431 001","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ASIA&course=431&section=001&sessyr=2020&sesscd=W","activity":"Lecture","term":"2","interval":"","days":" Tue Thu","start":"12:30","end":"14:00","comments":"If this course is blocked please sign up for the waitlist section. Students will be placed into the class based off our department priority guidelines. For more information please visit: http://www.asia.ubc.ca/undergraduate/department-wait-lists/ (Is the class blocked even though there are a few seats that are free? This is normal. Please check our website for what this means.)Uncover mystic Buddhist songs written by great Tantric adepts, steer through the complexity of philosophical treatises of great Tibetan Buddhist scholars, or read thrilling adventures in epic literature. In this course, students will read and discuss Tibetan literature in English translation (no language requirements) and engage with aspects of the rich material religious culture of Tibet, such as manuscripts and block prints.UBC has not yet confirmed an approach for Term 2 courses. The meeting days and times currently displayed reflect the maximum time that students will be expected to meet synchronously with the instructor. Should the decision be made to offer Term 2 courses online, one or more of these times may be dropped or reduced, and replaced with asynchronous learning tasks. These details will be updated here as they become available. The overall workload of the course will remain unchanged.","subject_code":"ASIA","course_number":"431","section_number":"001","building":"Henry Angus","room":"345","instructors":["SCHWERK, DAGMAR"],"totalRemaining":"45","currentlyRegistered":"10","generalRemaining":"45","restrictedRemaining":"0"},"W01":{"status":"Blocked","section":"ASIA 431 W01","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ASIA&course=431&section=W01&sessyr=2020&sesscd=W","activity":"Waiting List","term":"2","interval":"","days":" Tue Thu","start":"12:30","end":"14:00","comments":"Registering for this section does not mean you are enrolled in the course, this is a waitlist section. Students will be moved off the waitlist into the course automatically once there is space. For more information including our department priority guidelines please see: http://www.asia.ubc.ca/undergraduate/department-wait-lists/","subject_code":"ASIA","course_number":"431","section_number":"W01","building":" ","room":"","instructors":["SCHWERK, DAGMAR"],"totalRemaining":"50","currentlyRegistered":"0","generalRemaining":"50","restrictedRemaining":"0"}},"credits":"Credits: 3","description":"Tibetan literature, textual genres, and book and printing culture from the seventh century to the present."}
