{"course_name":"ASIA 394","subject_code":"ASIA","course_number":"394","course_title":"Post-Revolutionary Iranian Cinema","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=ASIA&course=394&sessyr=2020&sesscd=W","sections":{"001":{"status":" ","section":"ASIA 394 001","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ASIA&course=394&section=001&sessyr=2020&sesscd=W","activity":"Web-Oriented Course","term":"1","interval":"","days":" Wed","start":"16:00","end":"18:00","comments":"This course will introduce students to one of the most critically acclaimed cinemas in the world today, that is, postrevolutionary Iranian cinema, through the thematic lens of gender, sexuality, and diversity. During the semester, the students will watch and practice reading critically a wide variety of films by both world-renowned and new directors from Iran and the Iranian diaspora, focusing on the representations, constructions, and contestations of gender, sexuality, race, ethnicity, class, religion, ability, and bodily normativity in and through those films. Film screenings, class lectures and discussions, post-screening mini-quizzes, and pertinent readings on Iranian cinema, society, and culture and on critical diversity studies will provide the students with the conceptual tools a and ~nd the skill set required to complete their major group assignment. Despite its focus on the post-revolutionary era, the course will begin with an overview of Iranian cinema from its inception to the 1979 Revolution in order to provide sufficient context. The course argues that despite sociocultural and political challenges and restraints, an ever-growing thread of filmmakers within the postrevolutionary Iranian cinema has been effectively tackling vital issues concerning social and gender democracy in Iran. Importantly, these filmmakers represent no unified perspective, but a variety of perspectives, on the questions of gender, sexuality, and diversity.This course normally meets 3 hours per week. The overall workload for this course remains the same, though for this current term the content will be delivered in a mix-mode format. Students are expected to meet with the instructor synchronously online at the above listed days and times, and complete the rest of the learning tasks asynchronously as outlined in the course syllabus.","subject_code":"ASIA","course_number":"394","section_number":"001","building":" ","room":"","instructors":["ABEDINIFARD, MOSTAFA"],"totalRemaining":"4","currentlyRegistered":"86","generalRemaining":"4","restrictedRemaining":"0"},"W01":{"status":"Blocked","section":"ASIA 394 W01","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ASIA&course=394&section=W01&sessyr=2020&sesscd=W","activity":"Waiting List","term":"1","interval":"","days":" Wed","start":"16:00","end":"18:00","comments":"Registering for this section does not mean you are enrolled in the course, this is a waitlist section. Students will be moved off the waitlist into the course automatically once there is space. For more information including our department priority guidelines please see: http://www.asia.ubc.ca/undergraduate/department-wait-lists/","subject_code":"ASIA","course_number":"394","section_number":"W01","building":" ","room":"","instructors":["ABEDINIFARD, MOSTAFA"],"totalRemaining":"50","currentlyRegistered":"0","generalRemaining":"50","restrictedRemaining":"0"}},"credits":"Credits: 3","description":"Gender politics, family relationships, and women's social, economic, and political roles in post-revolutionary Iran as shown through Iranian cinema."}
