{
  "course_name": "ASTU 400B",
  "subject_code": "ASTU",
  "course_number": "400B",
  "course_title": "Interdisciplinary Studies in Arts - CLIMATE JUSTICE",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=ASTU&course=400B&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": "Blocked",
      "section": "ASTU 400B 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ASTU&course=400B&section=001&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "2",
      "interval": "",
      "days": [
        "WED"
      ],
      "start": "17:00",
      "end": "20:00",
      "comments": "This seminar will focus on how anthropogenic climate change interacts with structural inequities of race, class, locale, and gender to construct unique understandings of climate justice. Students will reflect on how their respective academic discipline and lived identity modulate their proximity to the environmental and sociocultural impacts of climate change. This seminar will take a peer education approach, where collaborative development and facilitation processes support students in co-creating the weekly lesson plans. An equity framework will allow us to weave together multiple intersecting perspectives, for example considering climate change as a social determinant of health; as a burden that disproportionately falls on Black and Indigenous communities; or as a call to action for e and ~xtractive industries.To view all Student Directed Seminars being offered in Winter 2020, please visit: https://students.ubc.ca/enrolment/courses/student-directed-seminars/student-directed-seminar-coursesNo prerequisite is required. Interested 3rd and 4th year students are strongly encouraged to send a statement of interest to Student Coordinators Rachel Cheang and Em Mittertreiner at cheangrchl@hotmail.com. Please include your year of study and major, as well as a 4-5 sentence statement of intent describing your interest in this seminar and reflecting on connections between climate change and your current academic field. Students will be admitted to the course as long as their submission demonstrates that they have interest in the course material and are willing to learn and engage in critical discussion, regardless of relevant experience. Applications will be reviewed on a rolling basis.",
      "subject_code": "ASTU",
      "course_number": "400B",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "TBA"
      ],
      "totalRemaining": "4",
      "currentlyRegistered": "11",
      "generalRemaining": "0",
      "restrictedRemaining": "4"
    }
  ],
  "credits": "Credits: 3",
  "description": "For upper-division students in the Faculty of Arts. Topics announced annually.",
  "terms": [
    "2"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
