{"course_name":"ASTU 400C","subject_code":"ASTU","course_number":"400C","course_title":"Interdisciplinary Studies in Arts - SOCL HRR","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=ASTU&course=400C&sessyr=2020&sesscd=W","sections":{"001":{"status":"Restricted","section":"ASTU 400C 001","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ASTU&course=400C&section=001&sessyr=2020&sesscd=W","activity":"Seminar","term":"2","interval":"","days":" Tue","start":"15:00","end":"18:00","comments":"When Jordan Peele\u0019s Get Out (2017) hit theatres, it sparked a contentious debate over whether or not it was considered horror. Peele stoked the fire by referring to the film as a \"social thriller\" in which he was inspired by The Stepford Wives (1975) and its portrayal of the social issues impacting women during the time it was created. Using horror to address social issues is not a new phenomenon, nor is it confined to film. This is the amazing power of horror: it is as enticing as it is accessible.So what is social horror, and how does it differ from traditional horror? In our seminar, we will address this question and explore how social horror can provide a space for marginalized authors to explore identity, empowerment, and resistance. We will be looking at ways that horror addresses intersecting social issues including class, race, Indigeneity, gender, sexuality and disability. We will also think of writing as an enactment of resistance against hegemonic discourses and a tool for generating powerful alternative narratives.In order to do so, this seminar combines literary analysis, writing craft discussion, and social justice critique. We'll also experiment with some generative work in order to understand how the authors we study use in the genre effectively. There are no prerequisites necessary to engage with the material, neither is a comprehensive understanding of specific theory, or any creative writing experience. In this seminar we will all explore new ideas and broaden our skill sets; a love of, or curiosity about, horror is all that is needed.","subject_code":"ASTU","course_number":"400C","section_number":"001","building":"Buchanan","room":"B312","instructors":["TBA"],"totalRemaining":"9","currentlyRegistered":"6","generalRemaining":"0","restrictedRemaining":"9"}},"credits":"Credits: 3","description":"For upper-division students in the Faculty of Arts. Topics announced annually."}
