{"course_name":"ASTU 400G","subject_code":"ASTU","course_number":"400G","course_title":"Interdisciplinary Studies in Arts - FANWRKS INTERNET","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=ASTU&course=400G&sessyr=2020&sesscd=W","sections":{"001":{"status":"Blocked","section":"ASTU 400G 001","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ASTU&course=400G&section=001&sessyr=2020&sesscd=W","activity":"Seminar","term":"2","interval":"","days":" Tue Thu","start":"14:00","end":"15:30","comments":"This course surveys current internet fan culture, analyzing fanart, fan fiction, fan videos, cosplay, and online fan spaces in the context of gender studies, critical theory, queer theory, sociology, and other critical discourses. Questions this course will pose include; what is a fanwork? Why do people create fanworks? What is a fan? What is a fanwork's relationship with its text of origin? Are fanworks queer art? Are fanworks anti-capitalist art? Is creating a fanwork a political act? What is the relationship between fanworks and children's literature? How do fanworks represent and discuss the body?Please visit  https://fanworksinternetubc.carrd.co/ for more information about the seminar, or email oliviabrocklehurst99@gmail.com.In 200 words or less, please submit a statement of intent that addresses the following:- Why do you want to take the seminar? What are your motivations- personal, academic, etc- for studying this topic, in this format?- Why would you be an asset to the class? Explain why you are well-suited for a dynamic discussion-based course.- Your program of study and any previous history with fandom/fanworks/fan culture (students of any level of familiarity with the topic are welcome to apply). Statements can be submitted to oliviabrocklehurst99@gmail.com by September 30th, 2020.","subject_code":"ASTU","course_number":"400G","section_number":"001","building":"Irving K Barber Learning Centre","room":"157","instructors":["TBA"],"totalRemaining":"9","currentlyRegistered":"6","generalRemaining":"9","restrictedRemaining":"0"}},"credits":"Credits: 3","description":"For upper-division students in the Faculty of Arts. Topics announced annually."}
