{
  "course_name": "ANTH 427",
  "subject_code": "ANTH",
  "course_number": "427",
  "course_title": "Topics in Medical Anthropology",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=ANTH&course=427&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "ANTH 427 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ANTH&course=427&section=001&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "2",
      "interval": "",
      "days": [
        "MON",
        "WED"
      ],
      "start": "11:00",
      "end": "12:30",
      "comments": "ANTH427 Term 2:ANTH427 is a seminar that provides an anthropological and historical approach to the meaning of mental health, mental illness, the organization of psychiatric treatment, and the problems in the explanation of the distribution of mental illness in a population. Its main focus is to bring different materials to analytically engage students with key questions about the epistemological, social, economic, historical, and political determinants of mental well-being. Throughout the course, students will explore and critically think about how we understand mental health problems in their social context of North America and how have social scientists theorized and researched mental health and illness. By doing so, students will be exposed to literature that seeks to understand and interpret the w and ~ide diversity of individual and social experiences associated with \u001cmental illness.\u001d The course will require students to draw conceptual connections between theoretical literature and empirical historical cases.",
      "subject_code": "ANTH",
      "course_number": "427",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "WAINER, RAFAEL"
      ],
      "totalRemaining": "1",
      "currentlyRegistered": "39",
      "generalRemaining": "1",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": "Anthropological perspectives on health, illness, and disability as represented by classic and contemporary research in selected topics in medical anthropology including disease and human evolution, illness and human ecology, culture and epidemiology, ethnomedical systems, the relationship between folk and biomedicine and the cultural construction and social organization of health care, illness and disability. Specific content will vary from year to year. Consult the Department brochure.",
  "terms": [
    "2"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
