{
  "course_name": "ANTH 206",
  "subject_code": "ANTH",
  "course_number": "206",
  "course_title": "Witches, Vampires, and Zombies: Anthropology of the Supernatural",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=ANTH&course=206&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "ANTH 206 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ANTH&course=206&section=001&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "2",
      "interval": "",
      "days": [
        "TUE",
        "THU"
      ],
      "start": "09:30",
      "end": "11:00",
      "comments": "What is the supernatural, and why are we fascinated with it? Where do supernatural beliefs come from? How are supernatural creatures such as witches, vampires, and zombies enjoying a new life in the modern world? These are some of the questions this course will address. This course examines supernatural and occult traditions as they appear in the context of religion, narrative, healing, ritual and media accounts and presentations. We will also study how anthropologists and scholars from related disciplines have approached these topics. This course does not attempt to prove or disprove the existence of supernatural phenomena. Rather, it takes an ethnographic, phenomenological approach to this issue, focusing on peoples lived experience and their attempts to make sense of it. Students will and ~ be encouraged to explore the relationship between scientific belief and supernatural belief in the context of both traditional cultures and the contemporary landscape.",
      "subject_code": "ANTH",
      "course_number": "206",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "MAGLIOCCO, SABINA"
      ],
      "totalRemaining": "1",
      "currentlyRegistered": "149",
      "generalRemaining": "1",
      "restrictedRemaining": "0"
    }
  ],
  "credits": "Credits: 3",
  "description": "Anthropological approaches to supernatural beliefs in both traditional and contemporary societies.",
  "terms": [
    "2"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
