{
  "course_name": "ANTH 203",
  "subject_code": "ANTH",
  "course_number": "203",
  "course_title": "Anthropology of Drugs",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=ANTH&course=203&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": "Full",
      "section": "ANTH 203 101",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ANTH&course=203&section=101&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "2",
      "interval": "",
      "days": [
        "TUE",
        "THU"
      ],
      "start": "11:00",
      "end": "12:30",
      "comments": "Anth 203 101:  This class examines the relationship between drugs, culture and structures of inequality.  We examine the physiological and psychological effects of various substances, their use in non-western societies, and the development of a global trade in such substances as sugar, nicotine, cocaine, and marijuana concurrent with the evolution of colonialism and global capitalism.  We look at the use of psychedelics by both the CIA and the counter-culture, and we track the emergence of the \u001cwar on drugs\u001d and regimes of mass incarceration as well as the recent epidemic of opiate abuse.",
      "subject_code": "ANTH",
      "course_number": "203",
      "section_number": "101",
      "building": " ",
      "room": "",
      "instructors": [
        "GUSTERSON, HUGH PHILLIMORE"
      ],
      "totalRemaining": "0",
      "currentlyRegistered": "150",
      "generalRemaining": "0",
      "restrictedRemaining": "0"
    },
    {
      "status": " ",
      "section": "ANTH 203 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ANTH&course=203&section=001&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "1",
      "interval": "",
      "days": [
        "TUE",
        "THU"
      ],
      "start": "15:30",
      "end": "17:00",
      "comments": "In this class, we will examine the cultures of control that target the commerce and consumption of illegal drugs. We will consider the evolution of these policies and explore their impact in a variety of historical moments and social worlds. We will also examine how the criminalization of drugs has created an alternative market around which distinctive lifestyles and cultural practices have emerged with several specific case studies focused on the Americas. Those lifestyles and practices are commonly called narco-culture and have in recent years been the source of inspiration for a varied aesthetic genre in music, literature and popular television (among them narco corridos, narco novelas, narand~ co graffiti). While surveying and interpreting a selection of these aesthetic productions,  and ~this course will examine the social history of a variety of substances constructed as drugs including cocaine, Ayahuasca, valium and fentanyl. To illustrate the wide-ranging impacts of criminalization the course will track the historical transformation of these commodities from legal to illegal and sometimes back again.",
      "subject_code": "ANTH",
      "course_number": "203",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "MUEHLMANN, SHAYLIH",
        "DEBERDT, RAPHAEL",
        "PHILLIPS, NANCY"
      ],
      "totalRemaining": "4",
      "currentlyRegistered": "146",
      "generalRemaining": "4",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": "Illicit and/or licit drugs through historical, political, cultural and societal examples.",
  "terms": [
    "1",
    "2"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
