{
  "course_name": "ANTH 227",
  "subject_code": "ANTH",
  "course_number": "227",
  "course_title": "Introduction to Medical Anthropology",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=ANTH&course=227&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "ANTH 227 002",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ANTH&course=227&section=002&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "2",
      "interval": "",
      "days": [
        "MON",
        "WED",
        "FRI"
      ],
      "start": "14:00",
      "end": "15:00",
      "comments": "ANTH 227: Introduction to Medical Anthropology (in the COVID-19 world).  Welcome to the uncanny COVID-19 world. In this course, we will use our collective brain power to familiarize ourselves with medical anthropology. Medical anthropology dissects the relations among health, illness, social institutions, personal experience, and cultural representations. Medical anthropologists work comparatively, illuminating different systems for understanding and intervening into everyday medical problems. As we see with the current COVID-19 crisis, the relationship between health and illness is not only a matter of biological vulnerability, but of history, politics, economics, culture, and power. This course provides an introduction to medical anthropology with an overview of the intersection where  and ~health, culture, and political-economic power meet. It compels that you consider not only academically challenging materials on health and illness intra- and cross-culturally, but that you also question your own personal and social beliefs about bodies and the causes and reactions to their vulnerabilities. COVID-19 pandemics has exacerbated multiple concurrent health inequalities and social injustices. We will use the current COVID-19 pandemic crisis as our entry point into the ways medical anthropologists and social scientists attempt to understand and modify society. This is a socio-anthropological and historical approach to Canadian society (with some discussions beyond Canada). Its main assumption is that we cannot understand present-day conflicts and responses to the COVID-19 pandem and ~ics without looking at the forces that led to where we are today.",
      "subject_code": "ANTH",
      "course_number": "227",
      "section_number": "002",
      "building": " ",
      "room": "",
      "instructors": [
        "WAINER, RAFAEL"
      ],
      "totalRemaining": "24",
      "currentlyRegistered": "126",
      "generalRemaining": "24",
      "restrictedRemaining": "0"
    }
  ],
  "credits": "Credits: 3",
  "description": "An examination of health and illness, in their social and cultural contexts.",
  "terms": [
    "2"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
