{
  "course_name": "ANTH 495A",
  "subject_code": "ANTH",
  "course_number": "495A",
  "course_title": "Advanced Studies in Anthropology - ADV STUDIES",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=ANTH&course=495A&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "ANTH 495A 200",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ANTH&course=495A&section=200&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "2",
      "interval": "",
      "days": [
        "WED"
      ],
      "start": "13:00",
      "end": "16:00",
      "comments": "This class is dedicated to ethnographic engagement to further understandings of Asian Canadian experience that will at times be compared with or put in context with parallels in Asian American experience. Issues to be covered include: the historic exclusion of Chinese immigrants to Canada through the head tax, along with the importance of the Chinatown area now as a place icon for Vancouver; the uprooting, removal and incarceration of Japanese Canadians during WWII, a process which denied their existence and rights as Canadians and instead projected them as part of the country from which they or their forebears had immigrated; and the struggles for Redress by which Canada (and the United States) had to acknowledge the wrongs of removal and internment of Japanese-Canadians. We will also e and ~xplore the rise in the Korean Canadian community, and how K-Pop and K-Wave have brought more attention to that community, as well as considering South Asian and Southeast Asian communities in the greater Vancouver area. We may also make fieldtrips to pertinent sites related to these Asian Canadian communities. In case the class is limited to online, we will explore these sites virtually, including by exploring various virtual offerings provided by these communities.",
      "subject_code": "ANTH",
      "course_number": "495A",
      "section_number": "200",
      "building": " ",
      "room": "",
      "instructors": [
        "CREIGHTON, MILLIE"
      ],
      "totalRemaining": "31",
      "currentlyRegistered": "9",
      "generalRemaining": "31",
      "restrictedRemaining": "0"
    }
  ],
  "credits": "Credits: 3",
  "description": "An intensive examination of selected topics in Anthropology. Consult the Department for this year's offerings.",
  "terms": [
    "2"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
