{
  "course_name": "ANTH 540A",
  "subject_code": "ANTH",
  "course_number": "540A",
  "course_title": "Advanced Seminar - SACRED GEOGRPHY",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=ANTH&course=540A&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "ANTH 540A 003",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ANTH&course=540A&section=003&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "1",
      "interval": "",
      "days": [
        "TUE"
      ],
      "start": "15:00",
      "end": "18:00",
      "comments": "Anthropology 540 Sacred Geography Graduate Seminar (synopsis)The full measure of a culture embraces both the actions of a people and the quality of their aspirations, the nature of the metaphors that propel their lives. And no description of a people can be complete without reference to the character of their homeland, the ecological and geographical matrix in which they have determined to live out their destiny. Just as landscape defines character, culture springs from a spirit of place. A child raised to believe that a mountain is the abode of a protective spirit will be a profoundly different human being from a youth brought up to believe that a mountain is an inert mass of rock ready to be mined. Herein lies the essence of the relationship between many indigenous peoples and the natural world. Mountains, rivers, and forests are not perceived a and ~s being inanimate, as mere props on a stage upon which the human drama unfolds. For these societies, the land is seen to be alive, a dynamic force to be embraced and transformed by the human imagination.",
      "subject_code": "ANTH",
      "course_number": "540A",
      "section_number": "003",
      "building": " ",
      "room": "",
      "instructors": [
        "DAVIS, WADE"
      ],
      "totalRemaining": "9",
      "currentlyRegistered": "6",
      "generalRemaining": "9",
      "restrictedRemaining": "0"
    }
  ],
  "credits": "Credits: 3",
  "description": " ",
  "terms": [
    "1"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
