{"course_name":"ANTH 202A","subject_code":"ANTH","course_number":"202A","course_title":"Contemporary Social Problems - ANTH CON SOC PRB","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=ANTH&course=202A&sessyr=2020&sesscd=W","sections":{"001":{"status":" ","section":"ANTH 202A 001","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ANTH&course=202A&section=001&sessyr=2020&sesscd=W","activity":"Web-Oriented Course","term":"1","interval":"","days":" Tue Thu","start":"11:00","end":"12:30","comments":"ANTH 202/RGST 200: INTRODUCTION TO THE STUDY OF RELIGION:  In the twenty-first century, religion is an important index of identity. It is both a source of unity and conflict on the world stage, and provides powerful motivation for behavior. In this course, we will study a wide variety of religions from a comparative, cross-cultural, interdisciplinary perspective. We will approach religions as complex systems that share certain common features. Our primary focus in this course is not religious belief, but practice: what people do and why they do it. Additionally, we will look at how spirituality fits into the broader context of everyday human life. In a time of religious turbulence and conflict, this course is designed to make you aware of others\u0019 religious systems and worldviews, to enco and ~urage critical thought about religious belief and practice, and to promote an attitude of engaged religious pluralism.Instructor:  Dr. Sabina Magliocco is Professor of Anthropology and directs the interdisciplinary Program in the Study of Religion at UBC. She specializes in the study of modern Paganism and Wicca. Don\u0019t hesitate to contact her with questions at sabina.magliocco@ubc.ca","subject_code":"ANTH","course_number":"202A","section_number":"001","building":" ","room":"","instructors":["MAGLIOCCO, SABINA","CLARK, BYRON","O'HERN, CAILIN"],"totalRemaining":"1","currentlyRegistered":"99","generalRemaining":"1","restrictedRemaining":"0"}},"credits":"Credits: 3","description":"Cultural background to contemporary events; problems of nationalism and regional conflicts, economic and social development, gender, religion and social change. Course may stress a different region of the world in different years."}
