{
  "course_name": "FNIS 454",
  "subject_code": "FNIS",
  "course_number": "454",
  "course_title": "Indigenous New Media",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=FNIS&course=454&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": "Blocked",
      "section": "FNIS 454 101",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=FNIS&course=454&section=101&sessyr=2020&sesscd=W",
      "activity": "Seminar",
      "term": "2",
      "interval": "",
      "days": [
        "TUE"
      ],
      "start": "13:00",
      "end": "16:00",
      "comments": "Students will contextualize and comparatively analyze Indigenous new media from 1990 to the present moment. New media is loosely defined as digital, interactive and/or networkable content that involves user feedback and creative interaction, such as net and video art, video games, Geographic Information Systems (GIS), interactive installation, podcasts and stereoscopic photography. Focus will be on Internet art and curation, interactive websites and audio maps. Students will develop and put into practice a set of skills for analyzing, comparing, researching and writing about Indigenous new media and produce a collection of digital stories. If you have any questions, feel free to email Dr. David Gaertner at david.gaertner@ubc.ca. Credits will be granted for only one of FNSP 401F, FNSP  45 and ~4 or FNIS 454.  This section is intended for undergraduate students only.  If you are a graduate student, please visit: http://fnis.arts.ubc.ca/graduate-courses/ regarding the registration process. If the course is full, please email cis.program@ubc.ca to be added to the waitlist.",
      "subject_code": "FNIS",
      "course_number": "454",
      "section_number": "101",
      "building": " ",
      "room": "",
      "instructors": [
        "GAERTNER, DAVID"
      ],
      "totalRemaining": "0",
      "currentlyRegistered": "18",
      "generalRemaining": "0",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": "New media and digital storytelling works designed and implemented by Indigenous artists, authors, and programmers.",
  "terms": [
    "2"
  ],
  "activities": [
    "Seminar"
  ]
}
