{
  "course_name": "ARTH 350",
  "subject_code": "ARTH",
  "course_number": "350",
  "course_title": "Grounding the Islamic Image",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=ARTH&course=350&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "ARTH 350 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ARTH&course=350&section=001&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "2",
      "interval": "",
      "days": [
        "WED"
      ],
      "start": "09:00",
      "end": "12:00",
      "comments": "The traditional paradigm for studying the arts of the Islamic world has been one of lack and distinction: lack of the human figure in art, and hence an argument that sets the arts of the Islamic world categorically distinct from all anthropocentric artistic practices. Apart from problems arising from situating the human figure at the centre of what defines art-proper, this paradigm has created a serious misconception. Both figurative art, including representations of the human form, and commentaries on visuality were widespread in the Islamic world. Although recent scholarship acknowledges this fact, in publications and exhibitions images still occupy a minor space. More importantly, where they appear, images are seldom analyzed beyond descriptive discussions of their aesthetic values. T and ~his course studies thematically selected visual arts from the Islamic world by discussing what particular discourses they produced in their individual historical contexts.",
      "subject_code": "ARTH",
      "course_number": "350",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "SALGIRLI, SAYGIN"
      ],
      "totalRemaining": "23",
      "currentlyRegistered": "37",
      "generalRemaining": "23",
      "restrictedRemaining": "0"
    }
  ],
  "credits": "Credits: 3",
  "description": "Contextualizing the complex language of images in the Islamic world.",
  "terms": [
    "2"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
