{"course_name":"STAT 547N","subject_code":"STAT","course_number":"547N","course_title":"Topics in Statistics - ECO + MAR STAT","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=STAT&course=547N&sessyr=2020&sesscd=W","sections":{"101":{"status":"Restricted","section":"STAT 547N 101","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=STAT&course=547N&section=101&sessyr=2020&sesscd=W","activity":"Web-Oriented Course","term":"1","interval":"","days":" Tue Thu","start":"14:00","end":"15:30","comments":"Statistics in Ecology and Marine Sciences. Data in ecology and marine sciences are frequently associated with large challenges. Controlled experiments are often difficult and observational studies are often associated with missing data and measurement error. This class will introduce some of the challenges of using statistics to answer questions in ecology and marine sciences and the statistical tools developed to handle them. Topics covered in this class are: missing data, multiple imputation, censored and truncated data, GLMs, overdispersion, hidden Markov models, and state-space models. This course is a statistics class for graduate students in the Department of Statistics (STAT) and the Ocean and Fisheries Graduate program (OCF). This class is intended for students with good statisti and ~cs background and some familiarity with R. The class is not recommended for students will little experience analysing data and those with limited R programming skills. In general, we do not recommend the class for first year MSc students in the OCF program. For STAT students, this class is more adequate for MSc level students than PhD students and/or students interested in practicing their consulting skills. STAT 547N and FISH 506H are cross-listed. STAT students are expected to enrol in STAT 547N and OCF students are expected to enrol in FISH 506H. Please contact the instructor if you have any concerns. Students from other graduate programs can contact the instructor if interested, but priority will be given to students in STAT and OCF.","subject_code":"STAT","course_number":"547N","section_number":"101","building":" ","room":"","instructors":["AUGER-METHE, MARIE","AUGER-METHE, MARIE(Coordinator)"],"totalRemaining":"11","currentlyRegistered":"4","generalRemaining":"0","restrictedRemaining":"11"}},"credits":"Credits: 1.5","description":"Students should consult the Statistics Department for the particular advanced topics offered in a given year."}
