{"course_name":"GEOG 498","subject_code":"GEOG","course_number":"498","course_title":"Geographies of the Middle East","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=GEOG&course=498&sessyr=2020&sesscd=W","sections":{"101":{"status":" ","section":"GEOG 498 101","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=GEOG&course=498&section=101&sessyr=2020&sesscd=W","activity":"Seminar","term":"1","interval":"","days":" Wed","start":"9:00","end":"12:00","comments":"Mix of asynchronous and synchronous components: Several synchronous online seminars held during the scheduled class time.The so-called region of the Middle East is diverse and complex. Often the focus on the Middle East and what most people know about the region is based on rhetoric and media attention of the political conflicts, refugees and rising extremist Islam. The aim of this course is to take a broader approach to understanding the region and its global reach through deconstructing the \u0018mainstream\u0019 narratives surrounding the region. The foundational lens is to understand the Middle East region in terms of its economic and political development, and how these have influenced and continue to influence the societies of the region more broadly. The Middle East has been shaped by conflicts between those with progressive views on flexible social structures and technological change, and those who would fav and ~our a rigid social hierarchy in order to maintain the power of a small elite. As academic institutions in the West have often presented a certain perception of the Middle East, this course adopts a different approach; readings and discussions will also focus on the Middle East\u0019s perception of the Western world in a reversal of Said\u0019s Orientalism rather a case of Occidentalism. Assignments will focus on creating alternative narratives of the region in the hope of building connections and broader understandings.","subject_code":"GEOG","course_number":"498","section_number":"101","building":" ","room":"","instructors":["MCPHEE, SIOBHAN"],"totalRemaining":"3","currentlyRegistered":"27","generalRemaining":"3","restrictedRemaining":"0"},"WL1":{"status":"Blocked","section":"GEOG 498 WL1","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=GEOG&course=498&section=WL1&sessyr=2020&sesscd=W","activity":"Waiting List","term":"1","interval":"","days":" ","start":"","end":"","comments":"Note: This is a wait list for GEOG 498, section 101, Term 1. You will be moved into active registration if space becomes available. Wait list does not guarantee placement in this course.","subject_code":"GEOG","course_number":"498","section_number":"WL1","building":"","room":"","instructors":["10","0","10","0"],"totalRemaining":"","currentlyRegistered":"","generalRemaining":"","restrictedRemaining":""}},"credits":"Credits: 3","description":"Critical analysis of economic, social, and political development and processes defining the modern Middle East region."}
