{
  "course_name": "ECON 318",
  "subject_code": "ECON",
  "course_number": "318",
  "course_title": "History and Philosophy of Economics from Aristotle to Adam Smith",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=ECON&course=318&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "ECON 318 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=ECON&course=318&section=001&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "1",
      "interval": "",
      "days": [
        "TUE",
        "THU"
      ],
      "start": "15:30",
      "end": "17:00",
      "comments": "This course is cross-listed with PHIL 362. Students can register in either section. We will trace the development of economic thought from Aristotle to Malthus, also reading brief excerpts from the work of Aquinas, Mun, Locke, and Quesnay (links on UBC Connect). We will read, in more depth, the writings of David Hume and Adam Smith, and derive additional context from the famous book by Albert O. Hirschman. Our focus will be on the conceptual foundations of economics, particularly the problems of value, distribution, and economic growth, as well as the moral justification for the pursuit of commerce.  Please see the following link for the course outline:  https://philosophy.ubc.ca/profile/margaret-schabas/COVID-19 notice: Due to the on-line format, I will record each lecture and also post the lecture notes on Canvas.  I will lecture for about an hour in synchronous time, Tuesday and Thursday 3:30 to 4:30.  There will be a 5-minute break and I will then lead discussion sections for the remaining 15 minutes, starting in the second week. Some weeks, as noted, do not have discussion meet-ups, and in that case I will lecture for the full 80 minutes. The class will be broken into four groups and you are to attend your assigned discussion group.  I will hold two of these in non-synchronous blocks of time, to accommodate students in other time zones, most likely on Friday or the following Monday.  The midterm test and final exam will be issued as take-homes, with a 24-hour window to complete.",
      "subject_code": "ECON",
      "course_number": "318",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "SCHABAS, MARGARET"
      ],
      "totalRemaining": "2",
      "currentlyRegistered": "43",
      "generalRemaining": "2",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": "The development of economic thought from Aristotle to Adam Smith, focusing on the conceptual foundations of economics, particularly the problems of value, distribution, and economic growth.",
  "terms": [
    "1"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
