{
  "course_name": "PATH 531",
  "subject_code": "PATH",
  "course_number": "531",
  "course_title": "Molecular and Cell Biology of Cancer",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=PATH&course=531&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": "Blocked",
      "section": "PATH 531 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=PATH&course=531&section=001&sessyr=2020&sesscd=W",
      "activity": "Lecture",
      "term": "2",
      "interval": "",
      "days": [
        "WED"
      ],
      "start": "14:00",
      "end": "17:00",
      "comments": "Cross-listed with MEDG 521. This course is restricted to students with one of these specializations: ****PATH AND in one of these faculties: GRAD.PATH Students advised that there is significant overlap between ths course and PATH 502, which is a required course.  For this reason, it may be beneficial to select an alternate course.  Classes are at the BC Cancer Research Centre, Room TBA, 675 West 10th Avenue, Vancouver, BC.   Students are encouraged to enroll with prior coursework in molecular and cellular biology.  Upper level biochemistry is also helpful.  Students with previous experience in cancer research will benefit, however this is not a mandatory requirement. Most of the students who take the course will be conducting their thesis research in some area of cancer biology, detection or treatment.  Recommended textbook: \"Biology of Cancer\" by Robert Weinberg.",
      "subject_code": "PATH",
      "course_number": "531",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "GARNIS, CATHERINE",
        "LOCKWOOD, WILLIAM"
      ],
      "totalRemaining": "0",
      "currentlyRegistered": "3",
      "generalRemaining": "0",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": "This course focuses on molecular and cell biology of cancer and consists of a series of lectures/reviews combined with discussions and presentations by students on the topics selected by the instructors. Emphasis will be on students' presentations and discussion.",
  "terms": [
    "2"
  ],
  "activities": [
    "Lecture"
  ]
}
