{"course_name":"MUSC 532S","subject_code":"MUSC","course_number":"532S","course_title":"Advanced Studies in Music History and Musicology - SCORE&DECOLONIZ","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=MUSC&course=532S&sessyr=2020&sesscd=W","sections":{"001":{"status":"Full","section":"MUSC 532S 001","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=MUSC&course=532S&section=001&sessyr=2020&sesscd=W","activity":"Seminar","term":"1","interval":"","days":" Mon","start":"10:00","end":"12:00","comments":"Topic:  Beyond Hungry Listening: The Score and Decolonization.  The course takes its title from Dylan Robinson\u0019s new book Hungry Listening: Resonant Theory for Indigenous Sound Studies, which examines indigenous and settler practices of listening and proposes new critical modes of listening.  The book will be a central text for the class.  In addition, the class will participate in the show Soundings: An Exhibition in Five Parts to be held at the Morris and Helen Belkin Gallery on campus.  It explores how indigenous compositions and sound art disrupt conventional boundaries of sound, territory, and knowledge.  Students will meet with curators, artists, and musicians involved in the show.  The class will discuss the critical issues raised by Robinson and the Belkin show as well as the cha and ~llenges posed by decolonization.  The course will also be a companion to The Score: Performing, Listening, and Decolonization, a research cluster grant being led by Profs. Carrabré and Metzer.  There are three types of assignments: academic, creative, and public oriented.  Academic assignments include presentations and papers.  Creative work embraces performance, composition, prose reflections, and other artistic responses.  Public-oriented work involves podcasts, blogs, and other media aimed at the general public.  Such work may be posted on online media hosted by the research cluster grant.2020W Format: This course will be taught on campus, in a physically distanced face-to-face format, including a class Mondays from 10 am - noon, and opportunities to attend interviews and performances connected to the Soundings show at the Belkin.  Students who would like to take the class remotely will be allowed to do so.","subject_code":"MUSC","course_number":"532S","section_number":"001","building":" ","room":"","instructors":["CARRABRE, THOMAS","METZER, DAVID"],"totalRemaining":"0","currentlyRegistered":"9","generalRemaining":"0","restrictedRemaining":"0"}},"credits":"Credits: 3","description":"Research seminar on a core or emerging topic in music history or musicology. May be repeated to a maximum of 12 credits if different topics are covered."}
