{"course_name":"MUSC 532E","subject_code":"MUSC","course_number":"532E","course_title":"Advanced Studies in Music History and Musicology - WOMEN IN MUSIC","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=MUSC&course=532E&sessyr=2020&sesscd=W","sections":{"001":{"status":"Restricted","section":"MUSC 532E 001","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=MUSC&course=532E&section=001&sessyr=2020&sesscd=W","activity":"Seminar","term":"1","interval":"","days":" Mon","start":"12:30","end":"15:00","comments":"The seminar Women in Music investigates topics in the latest research on the roles played by women in the broadly conceived field of music (including theater, dance, opera, and media arts).  This course is not a historical survey of women in the history of music.  Rather, it takes a topical approach that allows students to engage with critical issues such as historiography of music and gender, performative and representational practices of women in music, historically and culturally contingent notions of femininity in music, gender and difference, voice, virtuosity, diva, collaboration between female and male music agents (e.g. composers, librettists, musicians), female sovereigns as supporters of music, music-making in convents, characterization of female characters in works by male or  and ~female composers, cross dressing in lyric theater, and exceptional female music teachers.  Instrumental and vocal music will be examined.  Students interested in non-Western music are encouraged to take this course, although most readings will be on Western art music from the seventeenth through the twenty-first century. In addition to doing weekly readings, participating actively in class discussion, and giving presentations of readings in class, every student will conduct original research on a topic related to women in music.  Each student will present the results of their research in front of the whole class and will write a research paper.  WIth MUSC 403E.2020W Format: Students attend an online seminar every Monday from 12:30-3 pm, and view short online asynchronous lectures. There will be extra online tutorial sessions for students who live in different time zones.","subject_code":"MUSC","course_number":"532E","section_number":"001","building":" ","room":"","instructors":["LAW, SIN YAN HEDY"],"totalRemaining":"1","currentlyRegistered":"9","generalRemaining":"0","restrictedRemaining":"1"}},"credits":"Credits: 3","description":"Research seminar on a core or emerging topic in music history or musicology. May be repeated to a maximum of 12 credits if different topics are covered."}
