{"course_name":"MUSC 430I","subject_code":"MUSC","course_number":"430I","course_title":"Major Composers - MOZART","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=MUSC&course=430I&sessyr=2020&sesscd=W","sections":{"001":{"status":"Restricted","section":"MUSC 430I 001","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=MUSC&course=430I&section=001&sessyr=2020&sesscd=W","activity":"Seminar","term":"2","interval":"","days":" Tue Thu","start":"11:30","end":"13:00","comments":"The upper-level undergraduate seminar MUSC 430I (001) \u001cMajor Composer: Mozart\u001d will introduce the standard and recent scholarly musicological studies on Mozart\u0019s music and his world. Topics include Mozart in Vienna, Haydn\u0019s impact on Mozart\u0019s string quartets, Mozart\u0019s concerto and aria type, Mozart and the opera seria convention, Mozart\u0019s Le Nozze di Figaro, sociability in Mozart\u0019s instrumental music, Mozart\u0019s Requiem and social justice, Mozart and modernist esthetics, Mozart\u0019s wit, the beauty of Mozart\u0019s music and aspects of human significance (e.g., melancholy). This course is synchronous, but students who live in different time zones will have access to recorded sessions. Students are to participate actively in discussions, present readings, and complete weekly assignments. Mid-term a and ~nd final exams will be take-home essay exams. Each student is to complete a research paper on Mozart\u0019s music or aspects of his life. Students who have special needs or requests should contact me (hedy.law@ubc.ca) by the first week of class.","subject_code":"MUSC","course_number":"430I","section_number":"001","building":" ","room":"","instructors":["LAW, SIN YAN HEDY"],"totalRemaining":"11","currentlyRegistered":"9","generalRemaining":"0","restrictedRemaining":"11"}},"credits":"Credits: 3","description":"The musical works of no more than two significant composers will be examined. Specific topics will be announced; may be repeated for credit."}
