{
  "course_name": "MUSC 535",
  "subject_code": "MUSC",
  "course_number": "535",
  "course_title": "Art Song: Interpretation, Collaboration, and Performance",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=MUSC&course=535&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": "Restricted",
      "section": "MUSC 535 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=MUSC&course=535&section=001&sessyr=2020&sesscd=W",
      "activity": "Seminar",
      "term": "1-2",
      "interval": "",
      "days": [
        "FRI"
      ],
      "start": "13:00",
      "end": "15:00",
      "comments": "Music 535 (Song Interpretation) is 4 credits. It may alternately be taken for 6 credits as Music 532C, Advanced Studies in Music History and Musicology - Song Interpretation with the permission of the instructor. This course is to be taken in the second year of study.  Open to MMus and DMA Voice, Opera, Piano PerformancePre-formed Duos preferred.In-depth study of Art Song interpretation and performance practice. The course has two components: 1) intensive private coachings for duos 2) a monthly performance class with all participants. Students will select their own repertoire interests - song cycles, thematic recital programming, contemporary repertoire, diverse languages and stylistic eras. Emphasis is on the fusion of poetry and musical content, dramatic text-recitation, collaborative partnership and rehearsal skill-building, traditional and alternative performance practice. Those with interests in art song theatre techniques may create/perform staged works. There may be occasional guest instructors for group classes.The 532C extra credits reflect a small written component.Pre-formed singer-piano teams are required. Maximum number of participants: 6 singers, 3-6 pianists.The course will include weekly rehearsals, two 1-hour coachings per month, and 6-8 in-class performances during the year. Public performances will be encouraged. While duo coachings are in private studio setting, participants are invited to audit at any time.Class will meet in Room 113 (Term 1) and Room 116 (Term 2).",
      "subject_code": "MUSC",
      "course_number": "535",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "SHARON, RENA"
      ],
      "totalRemaining": "6",
      "currentlyRegistered": "16",
      "generalRemaining": "0",
      "restrictedRemaining": "6"
    }
  ],
  "credits": "Credits: 4",
  "description": " ",
  "terms": [
    "1-2"
  ],
  "activities": [
    "Seminar"
  ]
}
