{
  "course_name": "POLI 464F",
  "subject_code": "POLI",
  "course_number": "464F",
  "course_title": "Problems in International Relations - PROB INTRL RELTN",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=POLI&course=464F&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": "Full",
      "section": "POLI 464F 002",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=POLI&course=464F&section=002&sessyr=2020&sesscd=W",
      "activity": "Seminar",
      "term": "2",
      "interval": "",
      "days": [
        "MON"
      ],
      "start": "14:00",
      "end": "17:00",
      "comments": "Students must have completed at least one 300-level or higher International Relations course.Human Right Advocacy: Case Study - Academic Freedom and Scholars at RiskIn this seminar, students will explore theories and processes related to international human rights advocacy.  Alongside a tracing of the growth of international human rights discourses, students will also analyze praxis, gaining an understanding of mechanisms through which a range of actors fight for human rights and how we as scholars can analyze such practice.  These lessons will be explored via a case study of the concept of Academic Freedom which focuses on the rights of scholars to engage open, scholarly inquiry without fear to their physical safety, freedom or other forms of persecution from states or interest groups.  As part of the seminar, students will conduct human rights research/monitoring and engage in advocacy on behalf of the Scholars at Risk network\u0013  an international n and ~etwork of institutions and individuals whose mission is to protect scholars and promote academic freedom (https://www.scholarsatrisk.org/).",
      "subject_code": "POLI",
      "course_number": "464F",
      "section_number": "002",
      "building": " ",
      "room": "",
      "instructors": [
        "PETERSON, JENNY"
      ],
      "totalRemaining": "0",
      "currentlyRegistered": "21",
      "generalRemaining": "0",
      "restrictedRemaining": "0"
    }
  ],
  "credits": "Credits: 3",
  "description": "Content varies from year to year. Consult the departmental website. One section (of 3 credits) is reserved for fourth-year students in the Major program in International Relations.",
  "terms": [
    "2"
  ],
  "activities": [
    "Seminar"
  ]
}
