{
  "course_name": "POLI 328Y",
  "subject_code": "POLI",
  "course_number": "328Y",
  "course_title": "Topics in Comparative Politics - COMPARATIVE POLI",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=POLI&course=328Y&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": "Blocked",
      "section": "POLI 328Y 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=POLI&course=328Y&section=001&sessyr=2020&sesscd=W",
      "activity": "Lecture",
      "term": "2",
      "interval": "",
      "days": [
        "WED",
        "FRI"
      ],
      "start": "12:00",
      "end": "13:30",
      "comments": "In this student-directed seminar, you get to learn about proactive ways to address sustainability issues in the economy, society, and environment by using perspectives from Sociology and Political Science. In addition to co-creating your learning experience with passionate peers, you also get to practice real-life data and policy analysis on sustainability topics!This seminar will take place during Term 2 on Wednesdays and Fridays from 12:30 to 2:00 pm in the Jack Bell Building for the School of Social Work (SOWK 326). (Note: seats in this seminar are limited, so if you're interested, please hurry!)This seminar has also been approved by the Political Science department, Sociology department, and International Relations program as counting towards upper-level credits required by Majors, Minors, and Honors in their respective specializations.To register for this seminar, please fill out this form: https://bit.ly/2VahNrEFor any questions about this seminar, contact Divija Madhani (she/hers), the seminar coordinator, divija.madhani@alumni.ubc.ca, or Dr. Emily Huddart Kennedy, the seminar's Faculty Sponsor, emily.kennedy@ubc.ca.",
      "subject_code": "POLI",
      "course_number": "328Y",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "TBA"
      ],
      "totalRemaining": "8",
      "currentlyRegistered": "7",
      "generalRemaining": "8",
      "restrictedRemaining": "0"
    }
  ],
  "credits": "Credits: 3",
  "description": "Topics will vary from year to year. Consult the departmental website.",
  "terms": [
    "2"
  ],
  "activities": [
    "Lecture"
  ]
}
