{"course_name":"POLI 308Z","subject_code":"POLI","course_number":"308Z","course_title":"Issues in Canadian Politics - ISSUES CDN POLI","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=POLI&course=308Z&sessyr=2020&sesscd=W","sections":{"002":{"status":"Blocked","section":"POLI 308Z 002","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=POLI&course=308Z&section=002&sessyr=2020&sesscd=W","activity":"Seminar","term":"2","interval":"","days":" Tue Thu","start":"13:00","end":"14:30","comments":"Student Directed Seminar: \"The Canadian response to the global refugee crisis.\". Faculty Sponsor: Dr. Jenny Peterson. Student Coordinators: Saya Soma  and  Credo CasmilTo register, please fill out this quick form to indicate your interests in the topic - https://ubc.ca1.qualtrics.com/jfe/form/SV_3UC0YoMrab0s6l7If you have any questions, please email the student facilitators at casmil@mail.ubc.caAre you interested in Canada's role in mitigating the Global Refugee Crises? If so, join this Student Directed Seminar (SDS) to critically engage with this pressing issue. SDSs can be a rewarding experience for highly motivated students! This seminar will analyze the Canadian approach to providing asylum for those who are forcibly displaced. Using the framework of three durable solutions proposed by the UNHCR, we will explore the strengths and weaknesses of Canada\u0019s asylum infrastructure. The subjects of analyses include the Canadian definition of \u0018a refugee,\u0019 asylum legal framework, private sector\u0019s role in resettlement sponsorship, NGOs support networks, individual programs supporting refugees like the Student Refugee Program by WUSC + UBC, and so on. The seminar will consist of discussions, presentations, and possible speakers from refugee-related organizations. Through the group project and corresponding term paper, students will examine specific issues within the Canadian refugee support system and propose possible  and ~solutions.","subject_code":"POLI","course_number":"308Z","section_number":"002","building":"Forest Sciences Centre","room":"1617","instructors":["TBA"],"totalRemaining":"1","currentlyRegistered":"14","generalRemaining":"1","restrictedRemaining":"0"}},"credits":"Credits: 3","description":"An examination of one or more major issues in Canadian politics (e.g., the Charter, electoral reform). Topics will vary from year to year."}
