{"course_name":"POLI 325","subject_code":"POLI","course_number":"325","course_title":"Communist and Post-Communist Politics","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=POLI&course=325&sessyr=2020&sesscd=W","sections":{"002":{"status":"Blocked","section":"POLI 325 002","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=POLI&course=325&section=002&sessyr=2020&sesscd=W","activity":"Seminar","term":"2","interval":"","days":" Tue Thu","start":"15:30","end":"17:00","comments":"Students interested in taking this Student Directed Seminar course are invited to complete this google form to receive an application: https://forms.gle/2ZqZyWHLaunMdV419The disintegration of the Soviet Union in 1991 saw immense geopolitical realignment in the nations of Eastern Europe and Eurasia. In this seminar, we will examine the contemporary domestic politics and foreign relations of the Russian Federation, and other former republics of the Soviet Union. A focus will be on Russia\u0019s present and future role in the global community, in part through examining the legacy of Soviet communism, and exploring current trends in regional conflicts and economic integration. How can we explain the rise of Putin and resurrection of authoritarianism? What are the guiding ideologies of Russian foreign policy? Why are certain former Soviet states now liberal democracies, while others still face the same challenges of 30 years ago? Key themes that will be discussed  and ~include Russian and post Soviet government, political identity, democratization, security studies, and civil society/activism.Further inquiries can be directed to RussianPolitics.UBC@gmail.com","subject_code":"POLI","course_number":"325","section_number":"002","building":"Buchanan","room":"B316","instructors":["SUNDSTROM, LISA"],"totalRemaining":"15","currentlyRegistered":"0","generalRemaining":"15","restrictedRemaining":"0"}},"credits":"Credits: 3","description":"An examination of the origins, development, and demise of Communist political systems, as well as the nature of post-Communist politics, with special emphasis on the Soviet Union and its successor states."}
