{
  "course_name": "POLI 341C",
  "subject_code": "POLI",
  "course_number": "341C",
  "course_title": "Contemporary Political Theory - CONTMP POLI THRY",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=POLI&course=341C&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": "Blocked",
      "section": "POLI 341C 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=POLI&course=341C&section=001&sessyr=2020&sesscd=W",
      "activity": "Seminar",
      "term": "2",
      "interval": "",
      "days": [
        "MON",
        "WED"
      ],
      "start": "17:00",
      "end": "18:30",
      "comments": "Please note this is a Student Directed SeminarPOLI 341(C) 001 'Experiencing Ambedkar' Course Description: Dr Babasaheb Bhimrao Ambedkar is most well-known for his critical role in writing India\u0019s constitution. As one of the most prominent Dalit freedom fighters, his socio-cultural and historical significance is undeniable but how much is known about him as a thinker and writer? This course aims to study Indian political theory beyond theNehrus and Gandhis, as well as to challenge casteist and government-mandated assumptions. This seminar is a unique opportunity for students to delve deeply into Ambedkar\u0019s intellectual contributions and living legacy, as well as to help create an environment where caste and casteism can be critically explored head-on.Evaluation is based on participation, written essays, journal entries and presentations, as well as innovative open educationassignments.Coordinator: Riya SamuelFaculty Sponsor: Dr. Sunera ThobaniRegistration by application only. Please fill out this form bit.ly/32Kdub9.",
      "subject_code": "POLI",
      "course_number": "341C",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "TBA"
      ],
      "totalRemaining": "6",
      "currentlyRegistered": "9",
      "generalRemaining": "6",
      "restrictedRemaining": "0"
    }
  ],
  "credits": "Credits: 3",
  "description": "Topics may include freedom, colonialism, capitalism, Critical Theory and ideology, power and knowledge, social justice, rationalism, gender and identity politics, and the \"political.\"",
  "terms": [
    "2"
  ],
  "activities": [
    "Seminar"
  ]
}
