{
  "course_name": "BIOL 548V",
  "subject_code": "BIOL",
  "course_number": "548V",
  "course_title": "Advanced Topics in Biology - ADV TOPICS BIOL",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=BIOL&course=548V&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "BIOL 548V 101",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=BIOL&course=548V&section=101&sessyr=2020&sesscd=W",
      "activity": "Lecture",
      "term": "1",
      "interval": "",
      "days": [
        "TUE",
        "THU"
      ],
      "start": "10:30",
      "end": "12:00",
      "comments": "Course description: SYNTHESIS STATISTICS FOR ECOLOGY AND EVOLUTIONThis course will provide an introduction and overview of approaches for synthesizing the highly structured, multi-sourced datasets that typify ecology, evolution, and environmental research, including data collation, integration, analysis, and visualization. Students will learn how to define their research question and scope in the context of other studies in their subfield and how to find and fill in gaps in understanding with additional datasets. We will also provide a broad overview of the different types of methods used for synthesizing data including hierarchical models, meta-analysis, model integration, and model updating, providing students a guide to navigating these methods and identifying methods to learn and use in their research. Students will develop skills in R programming, and ~ collaborative research, reproducible workflows, data analysis, and communication.Delivery format\"\t8 sessions, 1.5 hours per session\"\teach session generally includes a lecture and hands-on component, each varying in length among sessionsPre-requisites\"\tGraduate-level thesis in Ecology or Evolutionary Biology\"\tIntroductory coding experience or a willingness to learnFull syllabus: https://osf.io/a9k5b/wiki/Course%20outline/Tuesday, Thursday 10:30-12:00 PDT.  Sept 28-Oct 30 excluding week of Oct. 19. All modules are 12 hours (8 meetings) eachInstructors: Jennifer Sunday, Laura Pollock and postdocs from Living Data Project.",
      "subject_code": "BIOL",
      "course_number": "548V",
      "section_number": "101",
      "building": " ",
      "room": "",
      "instructors": [
        "AMUNDRUD, SARAH",
        "SRIVASTAVA, DIANE"
      ],
      "totalRemaining": "4",
      "currentlyRegistered": "11",
      "generalRemaining": "4",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 1,
  "description": " ",
  "terms": [
    "1"
  ],
  "activities": [
    "Lecture"
  ]
}
