{
  "course_name": "RUSS 303",
  "subject_code": "RUSS",
  "course_number": "303",
  "course_title": "Topics in Russian Culture (in English)",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=RUSS&course=303&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "RUSS 303 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=RUSS&course=303&section=001&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "1",
      "interval": "",
      "days": [
        "WED"
      ],
      "start": "18:00",
      "end": "21:00",
      "comments": "What makes Russian culture unique? Why does it place such a high value on the homeland, on close personal relationships, and on openness in expressing emotions?  Are these values real, or just clichés?In this course, we will discuss the fundamental values that structure the Russian worldview, the historical events and societal pressures that went into forming it, and how these values are evident in the manifestations of Russian high culture we are all familiar with today.The class format is flexible. You can choose either a synchronous or asynchronous option. Students who choose the asynchronous option must participate by posting on the course discussion board. The course includes recorded lectures with slide illustrations, virtual synchronous seminars, online discussions, assigned readings from classic Russian literature, and films from celebrated Russian directors.",
      "subject_code": "RUSS",
      "course_number": "303",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "CHITNEV, VETA"
      ],
      "totalRemaining": "26",
      "currentlyRegistered": "14",
      "generalRemaining": "26",
      "restrictedRemaining": "0"
    }
  ],
  "credits": "Credits: 3",
  "description": "Features of Russian culture with an emphasis on historical and social contexts. Specific course content will vary. Consult CENES for this year's offerings at https://cenes.ubc.ca/undergraduate/slavic-studies/russian-minor/",
  "terms": [
    "1"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
