{
  "course_name": "HIST 403F",
  "subject_code": "HIST",
  "course_number": "403F",
  "course_title": "Seminar in the History of International Relations - GRAPHIC NOVEL",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=HIST&course=403F&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": "Full",
      "section": "HIST 403F 201",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=HIST&course=403F&section=201&sessyr=2020&sesscd=W",
      "activity": "Seminar",
      "term": "2",
      "interval": "",
      "days": [
        "THU"
      ],
      "start": "14:00",
      "end": "16:00",
      "comments": "The Middle East in Graphic Novels: History, Politics and the Tragic Comic:Once thought of as juvenile and immaterial to politics, society and culture, graphic novels are today frequently considered art forms, political satires and/or intellectual compositions fundamental to the health of our polities as well as our imaginings of past and present. This course explores graphic novels with a focus on their representation of Middle Eastern history, politics and peoples. Reading such works as Joe Sacco\u0019s Footnotes in Gaza, Marjane Satrapi\u0019s Persepolis, Craig Thompson\u0019s Habibi, Brian K. Vaughan\u0019s Pride of Baghdad and several others, we will discuss the evolution of the medium, the fraught history of visually representing the Middle East, as well as the challenges and opportunities graphic novels present for understanding the region. On this latter note, particular a and ~ttention will be paid to the contentious use of graphic novels as works of journalism, oral history, and autobiography as well as to fundamental questions on the ethics of graphically representing tragic episodes from Middle Eastern pasts. Finally, given recent events associated with cartooning (i.e. the Charlie Hebdo massacre) we will also seek to grapple with such divisive issues as Islamophobia, Orientalism, free speech, and the uses and limits of satire.",
      "subject_code": "HIST",
      "course_number": "403F",
      "section_number": "201",
      "building": " ",
      "room": "",
      "instructors": [
        "UNWALLA, PHEROZE"
      ],
      "totalRemaining": "0",
      "currentlyRegistered": "18",
      "generalRemaining": "0",
      "restrictedRemaining": "0"
    }
  ],
  "credits": "Credits: 3",
  "description": "Selected topics in the history of international relations. Restricted to fourth year students majoring in History or International Relations.",
  "terms": [
    "2"
  ],
  "activities": [
    "Seminar"
  ]
}
