{
  "course_name": "HIST 403L",
  "subject_code": "HIST",
  "course_number": "403L",
  "course_title": "Seminar in the History of International Relations - INTL COMMUNIST",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=HIST&course=403L&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "HIST 403L 101",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=HIST&course=403L&section=101&sessyr=2020&sesscd=W",
      "activity": "Seminar",
      "term": "1",
      "interval": "",
      "days": [
        "WED"
      ],
      "start": "11:00",
      "end": "13:00",
      "comments": "This seminar will be held online. The topic is International communist movement and its legacies: The seminar explores the international role of communist movements during the twentieth century, their ambitious or utopian goals and more modest, but impressive accomplishments. Particular attention will be paid to the following topics: the opposition to WWI and the principle of self-determination, communist internationalism and the rise of anti-imperialist movements, women\u0019s equality project, ethnic minorities rights and affirmative action, government regulation and planning, public health care and higher education, labour movement and workers\u0019 rights, military confrontation with international fascism and WWII, international peace movement, decolonization in Asia and Africa, the struggle a and ~gainst racism and segregation in the US and South Africa, communist sects (Anarchism, Stalinism, Trotskyism, Maoism, Eurocommunism), the fall of communist parties in Eastern Europe and their continuing influence in Asia.",
      "subject_code": "HIST",
      "course_number": "403L",
      "section_number": "101",
      "building": " ",
      "room": "",
      "instructors": [
        "KOJEVNIKOV, ALEXEI"
      ],
      "totalRemaining": "5",
      "currentlyRegistered": "13",
      "generalRemaining": "5",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": "Selected topics in the history of international relations. Restricted to fourth year students majoring in History or International Relations.",
  "terms": [
    "1"
  ],
  "activities": [
    "Seminar"
  ]
}
