{"course_name":"HIST 403A","subject_code":"HIST","course_number":"403A","course_title":"Seminar in the History of International Relations - ORIGINS OF WWI","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=HIST&course=403A&sessyr=2020&sesscd=W","sections":{"101":{"status":"Full","section":"HIST 403A 101","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=HIST&course=403A&section=101&sessyr=2020&sesscd=W","activity":"Seminar","term":"1","interval":"","days":" Mon","start":"13:00","end":"15:00","comments":"This seminar will be held online. The Origins of the First World War: World War I was one the great turning points of world history: the bloody, brutal birth of the 20th century, it was a watershed moment that gave birth to an era of imperial collapse and total war.  The war itself, as well as its causes and ramifications, continue to fascinate both professional and armchair historians. In this course, we will try to understand why the Great Powers of Europe went to war against each other in 1914.  Over a hundred years after the assassination of Archduke Franz Ferdinand, this apparently simple question still cannot be answered in a completely satisfactory fashion.  Scholarly disagreements over this question were once the result of patriotically-motivated attempts to blame one side or the and ~ other, but they are now indicative of deep divisions within academic history itself.  Looking at primary sources, we will examine the diplomatic, military, economic, and social causes of the war that have often been pointed to.  But we will also study a century's worth of historical interpretations to see what these tell us about the Great War and about the world it helped shape.","subject_code":"HIST","course_number":"403A","section_number":"101","building":" ","room":"","instructors":["LANTHIER, MICHAEL"],"totalRemaining":"0","currentlyRegistered":"18","generalRemaining":"0","restrictedRemaining":"0"}},"credits":"Credits: 3","description":"Selected topics in the history of international relations. Restricted to fourth year students majoring in History or International Relations."}
