{
  "course_name": "HIST 433",
  "subject_code": "HIST",
  "course_number": "433",
  "course_title": "Fourth-Year Honours Seminar",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=HIST&course=433&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "HIST 433 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=HIST&course=433&section=001&sessyr=2020&sesscd=W",
      "activity": "Seminar",
      "term": "1",
      "interval": "",
      "days": [
        "MON"
      ],
      "start": "13:00",
      "end": "15:00",
      "comments": "HIST 433 restricted to 4th year History honours students.Manifesting History: Narrative, Research, Memory:This course, which is mandatory for all fourth-year Honours students, has two primary objectives. The first is to introduce students to some fundamental issues of historical theory and practice. We shall examine not only how people remember, forget, and restructure the past as an ongoing part of the construction of themselves and their worlds, but also the expression of this construct in diverse forms and genres, with their attendant possibilities and constraints. The readings and topics will be general and not limited to any historical period or geography.  The second goal of the course is to help students conceptualize and write their honours graduating essays.  To support this objective we read about and discuss many of the practical elements of historical research, including archival and ~ research, digital techniques, and more.We will read a range of texts selected both for their thematical content and for their utility as models of historical writing. In the first semester, close readings of texts will allow students to explore the \u001cnuts and bolts\u001d of how writers ask historical questions, make their arguments, find and use sources, and situate their work in relation to relevant historiographies. The second semester will focus closely on students\u0019 own theses in progress. The focus of these class meetings will be critical (but supportive and constructive) engagement with one another\u0019s writing. Course evaluations will be based on participation in discussion and various writing assignments.",
      "subject_code": "HIST",
      "course_number": "433",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "BRAIN, ROBERT"
      ],
      "totalRemaining": "5",
      "currentlyRegistered": "12",
      "generalRemaining": "5",
      "restrictedRemaining": "0"
    }
  ],
  "credits": "Credits: 6",
  "description": " ",
  "terms": [
    "1"
  ],
  "activities": [
    "Seminar"
  ]
}
