{
  "course_name": "HIST 490Y",
  "subject_code": "HIST",
  "course_number": "490Y",
  "course_title": "Seminar for Majors in History - CNADA & THRD RCH",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=HIST&course=490Y&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "HIST 490Y 101",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=HIST&course=490Y&section=101&sessyr=2020&sesscd=W",
      "activity": "Seminar",
      "term": "1",
      "interval": "",
      "days": [
        "WED"
      ],
      "start": "14:00",
      "end": "16:00",
      "comments": "(HIST 490 is intended for History majors, History honours students, and students majoring in the history and philosophy of science, but students from other departments may register if they obtain the instructor's permission.) In 2020W, this seminar will be held online. The topic for HIST 490Y, 101 is Canada and the Third Reich. We will examine Canadian reactions to Nazi Germany from the time of Hitler's rise to power until the end of the Second World War, with some attention also paid to Canadian reactions to the immediate postwar period. We will examine the interactions between state actors by examining foreign policy before the war, and government attitudes to postwar trials of Nazi war criminals.  Much of the focus, however, will be on non-state actors, on how pro-Nazi and anti-Nazi g and ~roups mounted lobbying efforts before the outbreak of war (focusing on the topics of economic boycotts, the 1936 Olympics and the Spanish Civil War), and on the attitudes of Canadian soldiers and the Canadian public to Nazi Germany at the end of the war.",
      "subject_code": "HIST",
      "course_number": "490Y",
      "section_number": "101",
      "building": " ",
      "room": "",
      "instructors": [
        "MENKIS, RICHARD"
      ],
      "totalRemaining": "9",
      "currentlyRegistered": "9",
      "generalRemaining": "9",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": "Selected problems in the theory and practice of historical work. Check with the department for course offerings. Restricted to fourth year students majoring in History or in the History and Philosophy of Science. Also open to History Honours students.",
  "terms": [
    "1"
  ],
  "activities": [
    "Seminar"
  ]
}
