{
  "course_name": "HIST 421B",
  "subject_code": "HIST",
  "course_number": "421B",
  "course_title": "Honours Tutorial - HONOURS TUTORIAL",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=HIST&course=421B&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "HIST 421B 101",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=HIST&course=421B&section=101&sessyr=2020&sesscd=W",
      "activity": "Tutorial",
      "term": "1",
      "interval": "",
      "days": [
        "MON"
      ],
      "start": "10:00",
      "end": "12:00",
      "comments": "HIST 421B restricted to 4th year History honours students.Decolonization: Between 1945 and 1980, as most of Africa, South Asia, and Southeast Asia declared itself independent of foreign rule, the citizens of new nation-states confronted a hard reality: a clean break would be impossible. In this seminar, students will examine the different ways that people in different contexts attempted to overcome forms of colonialism both before and after new flags were lifted over new countries. (There will be an emphasis, though not an exclusive one, on African histories.) We will examine cultural nationalism, the contentious politics of independence movements, the attempts of new regimes to revise or undo longstanding and unequal economic relationships, and the everyday experiences of ordinary people as they took part in what was often an experimental restructuring of soc and ~iety. In doing so, we will debate competing theories of informal imperialism and dependence, and examine the ways that independence was imagined, including alternatives that never came to be and narratives that were silenced. The course also functions as a workshop for the writing of a 20-25 page paper of original research, and toward that end students will become familiar with efforts to \u001cdecolonize\u001d literature and scholarship.",
      "subject_code": "HIST",
      "course_number": "421B",
      "section_number": "101",
      "building": " ",
      "room": "",
      "instructors": [
        "MORTON, DAVID"
      ],
      "totalRemaining": "1",
      "currentlyRegistered": "4",
      "generalRemaining": "1",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 6,
  "description": " ",
  "terms": [
    "1"
  ],
  "activities": [
    "Tutorial"
  ]
}
