{
  "course_name": "HIST 490R",
  "subject_code": "HIST",
  "course_number": "490R",
  "course_title": "Seminar for Majors in History - VIOLENCE & RACE",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=HIST&course=490R&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": " ",
      "section": "HIST 490R 201",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=HIST&course=490R&section=201&sessyr=2020&sesscd=W",
      "activity": "Seminar",
      "term": "2",
      "interval": "",
      "days": [
        "TUE"
      ],
      "start": "09:30",
      "end": "11:30",
      "comments": "(HIST 490 is intended for History majors, History honours students, and students majoring in the history and philosophy of science, but students from other departments may register if they obtain the instructor's permission.)In 2020W, the topic for HIST 490R is Violence, Terror and Race.  This seminar examines the broad meanings as well as the physical, emotional and psychological consequences of violence and terror as they intersect with fluid constructions and meanings of race. This course will explore the multiple ways that violence and terror are conceived, imagined, understood (individual, social, institutional, economic), and applied by a number of social, political and ethnic/racial sectors and actors.HIST 490R will be involve a mix of synchronous and asynchronous methods. Lectures will be recorded and posted on the course Canvas page for asynchronous viewing. Synchronous discussion sections will be held once a week.",
      "subject_code": "HIST",
      "course_number": "490R",
      "section_number": "201",
      "building": " ",
      "room": "",
      "instructors": [
        "MUNOZ, MARIA LEONOR OLIN"
      ],
      "totalRemaining": "1",
      "currentlyRegistered": "17",
      "generalRemaining": "1",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": "Selected problems in the theory and practice of historical work. Check with the department for course offerings. Restricted to fourth year students majoring in History or in the History and Philosophy of Science. Also open to History Honours students.",
  "terms": [
    "2"
  ],
  "activities": [
    "Seminar"
  ]
}
