{
  "course_name": "HIST 270A",
  "subject_code": "HIST",
  "course_number": "270A",
  "course_title": "China in World History - CHINA WORLD HIST",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=HIST&course=270A&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": "Full",
      "section": "HIST 270A 101",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=HIST&course=270A&section=101&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "1",
      "interval": "",
      "days": [
        "TUE"
      ],
      "start": "15:30",
      "end": "18:30",
      "comments": "HIST 270A: This course explores the history of China in a global context. We will begin our journey with the Mongol empire in the thirteenth century and conclude with some reflections on the most recent past. Our goals are two-fold: to introduce students to important critical skills, especially as they are related to the practice of historically-informed analyses; and to encourage students to reflect on not only the global dimensions of China\u0019s past but also, more generally, the inter-connectedness of human societies.  In 2020W, HIST 270A is cross listed with ASIA 270. Students should register in HIST 270A.This course will involve both synchronous and asynchronous learning. To accommodate students in different time zones, the weekly scheduled session on Tuesday will be split into two 80-minute sections (15:30-16:50 and 17:00-18:20). Before the start of Term 1, registered students will be given instructions via email on how to sign up for their preferred weekly 80-minute synchronous section. If the class is fully subscribed, interested students may join the waitlist by contacting the instructor @ leo.shin@ubc.ca",
      "subject_code": "HIST",
      "course_number": "270A",
      "section_number": "101",
      "building": " ",
      "room": "",
      "instructors": [
        "SHIN, LEO"
      ],
      "totalRemaining": "0",
      "currentlyRegistered": "31",
      "generalRemaining": "0",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": "The history of China in a global context, from the earliest times to the most recent past; how China has changed the world and how engagement with the world has changed China.",
  "terms": [
    "1"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
