{"course_name":"HIST 420D","subject_code":"HIST","course_number":"420D","course_title":"Topics in Canadian History - DRUGS IN CANADA","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=HIST&course=420D&sessyr=2020&sesscd=W","sections":{"201":{"status":" ","section":"HIST 420D 201","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=HIST&course=420D&section=201&sessyr=2020&sesscd=W","activity":"Lecture","term":"2","interval":"","days":" Tue Thu","start":"15:30","end":"17:00","comments":"How can studying the past help us to understand drugs and their place in Canada today, from the recent legalization of cannabis to the current opioid crisis to the idea of \"Dry January\" and beyond? This question drives HIST 420, which examines the history of drugs in Canada since 1867. Focusing on a wide range of drugs - alcohol, amphetamine, cannabis, cocaine, LSD, opium, oral contraception, tobacco, and more! - we will explore the social, cultural, political, and legal histories of such drugs, the people who have used them, and their changing meanings, regulation, and (de)criminalization over time in northern North America. Major themes will include the relationship between ideas about drugs, identity, the law, and policing; changing understandings of use, treatment, and addiction; and and ~ tensions between personal experiences, social meanings, popular culture, and medical, legal, and political approaches to different drugs. In addition to lectures, discussions, activities, and assignments, the course places a particular emphasis on learning through historical film, from drama, comedy, and documentary to media coverage and raw historical footage.There is no cost for textbooks in this course.","subject_code":"HIST","course_number":"420D","section_number":"201","building":"Irving K Barber Learning Centre","room":"185","instructors":["ISHIGURO, LAURA"],"totalRemaining":"10","currentlyRegistered":"30","generalRemaining":"10","restrictedRemaining":"0"}},"credits":"Credits: 3","description":"May include immigration, French-English relations, the growth of the state, health and welfare, or the family."}
