{
  "course_name": "CRWR 416A",
  "subject_code": "CRWR",
  "course_number": "416A",
  "course_title": "Writing for Television I - WRT TELEVISION 1",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=CRWR&course=416A&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": "Full",
      "section": "CRWR 416A 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=CRWR&course=416A&section=001&sessyr=2020&sesscd=W",
      "activity": "Seminar",
      "term": "1",
      "interval": "",
      "days": [
        "THU"
      ],
      "start": "15:00",
      "end": "17:00",
      "comments": "All CRWR Winter Term 1 (September-December) courses/sections will be held online. This particular course will be synchronous: Thursday, Sept 10, 2020 - Thursday, Dec 3, 2020, 3-5 pm Pacific Standard Time. There are online (asynchronous) screening costs: up to $25 TOTAL for specific shows on iTunes, Apple, or free trials on Amazon Prime, CBC Gem. Let the instructor know if this cost presents a challenge. Class will be held on Zoom, UBC and FIPPA compliant, and currently the industry-standard for TV writers\u0019 rooms and academic film programs. It will not be necessary to download the Zoom app\u0014students will be invited by email ten minutes before the synchronous session. Sessions will not be recorded; If a student does not choose to share their video image or prefers to be muted, it may be pos and ~sible to work-around with Zoom chat (in lieu of your audio feedback). All means necessary to protect privacy will be taken while also striving to build the community and trust of a writer\u0019s room. A working microphone and web camera are essential, as is decent bandwidth. Advance notice is essential for closed-captioning.",
      "subject_code": "CRWR",
      "course_number": "416A",
      "section_number": "001",
      "building": " ",
      "room": "",
      "instructors": [
        "SVENDSEN, LINDA"
      ],
      "totalRemaining": "0",
      "currentlyRegistered": "12",
      "generalRemaining": "0",
      "restrictedRemaining": "0"
    }
  ],
  "credits": "Credits: 3",
  "description": "A workshop class in writing for television.",
  "terms": [
    "1"
  ],
  "activities": [
    "Seminar"
  ]
}
