{"course_name":"FREN 225","subject_code":"FREN","course_number":"225","course_title":"Upper-Intermediate French II","course_link":"/cs/courseschedule?pname=subjarea&tname=subj-course&dept=FREN&course=225&sessyr=2020&sesscd=W","sections":{"201":{"status":" ","section":"FREN 225 201","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=FREN&course=225&section=201&sessyr=2020&sesscd=W","activity":"Web-Oriented Course","term":"2","interval":"","days":" Mon Wed Fri","start":"14:00","end":"15:00","comments":"A continuation of FREN 224. Communicative proficiency at an autonomous level: vocabulary enrichment, pronunciation practice, grammatical analysis and development of efficient reading and writing techniques. This course is aligned with level B2 objectives of the CEFR. This course is aligned with level B2 objectives of the CEFR. Full course description: https://fhis.ubc.ca/course-description/fren225/","subject_code":"FREN","course_number":"225","section_number":"201","building":" ","room":"","instructors":["SIMPSON, ANNE"],"totalRemaining":"1","currentlyRegistered":"34","generalRemaining":"1","restrictedRemaining":"0"},"202":{"status":" ","section":"FREN 225 202","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=FREN&course=225&section=202&sessyr=2020&sesscd=W","activity":"Web-Oriented Course","term":"2","interval":"","days":" Mon Wed Fri","start":"9:00","end":"10:00","comments":"Upper Intermediate French IIThe course uses an interactive approach to the review of French grammar, stressing communicative competence and is focused on:    the understanding of concrete or abstract topics in a complex text (oral or written);    the production of clear and detailed oral and written communication on a number of subjects (construction of arguments to defend one\u0019s opinion, explain one\u0019s viewpoint);    the ability to correct one\u0019s own mistakes (when speaking or writing);    vocabulary building, grammatical accuracy and socio-cultural competency using a wide variety of contemporary authentic documents (newspaper articles, videos, literary excerpts, blogs, music, etc.) of the French-Speaking world.The FREN 225 syllabus follows the Common European Framework of Reference guidelines for the B2.2 level.Three hours a week will be devoted to providing students with tools for interacting with a degree of fluency and spontaneity that makes regular interaction with native speakers possible without strain for either party. Students will be able to consolidate and expand their comprehension, speaking, reading and writing skills in French while discussing socio-cultural topics.Students will share ideas in collaborative small groups and whole class discussion, oral presentation, debates, or other assignments. French grammatical structures such as relative pronouns, the passive form, and the subjunctive, will be studied within a task-based approach.Lectures and class discussions are all conducted in French. If you are unsure whether this is the appropriate level of French course for you, click here","subject_code":"FREN","course_number":"225","section_number":"202","building":" ","room":"","instructors":["PALISSE, STEPHANIE"],"totalRemaining":"8","currentlyRegistered":"27","generalRemaining":"8","restrictedRemaining":"0"},"W02":{"status":" ","section":"FREN 225 W02","href":"/cs/courseschedule?pname=subjarea&tname=subj-section&dept=FREN&course=225&section=W02&sessyr=2020&sesscd=W","activity":"Waiting List","term":"2","interval":"","days":" ","start":" ","end":" ","comments":"FREN 225 W02 is a general waitlist for all FREN 225 sections in Term 2.  Registering for this waitlist (W02) serves two purposes: 1) If space opens up in any section of this course, you will be notified and/or placed automatically in the open section (W02 -> Any Section);  2) If there is sufficient demand for an additional section of this course to be offered, you will be notified when an additional section is created. Full sections will at times be blocked for registration and waitlisted students will be transferred to sections on a priority basis.","subject_code":"FREN","course_number":"225","section_number":"W02","building":"No Scheduled Meeting","room":"","instructors":["TBA"],"totalRemaining":"100","currentlyRegistered":"0","generalRemaining":"100","restrictedRemaining":"0"}},"credits":"Credits: 3","description":"A continuation of FREN 224. This course is aligned with level B2 objectives of the CEFR."}
