{
  "course_name": "GERM 303",
  "subject_code": "GERM",
  "course_number": "303",
  "course_title": "German Literature Before 1900 (in English)",
  "course_link": "/cs/courseschedule?pname=subjarea&tname=subj-course&dept=GERM&course=303&sessyr=2020&sesscd=W",
  "sections": [
    {
      "status": "Cancelled",
      "section": "GERM 303 001",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=GERM&course=303&section=001&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "1",
      "interval": "",
      "days": [
        ""
      ],
      "start": "",
      "end": "",
      "comments": "This course offers students an introduction to the role and engagement of women in the development of German theatre and drama in the bourgeois era, spanning from the late-1700s to the Fin de Siècle. We'll focus on three dramatic works, juxtaposing \"canonized\" male productions, such as Schiller's Don Carlos (1787) with Christiane Karoline Schlegel's bourgeois tragedy Düval und Charmille (1778) and Elsa Bernstein's Twilight (1897). Course Readings include: Johann Wolfgang von Goethe, \"The Bride from Corinth, \" as well as theoretical writings by Immanuel Kant (\"On the Question: What is Enlightenment?\"), Adorno/Horkheimer (\"Dialectics of Enlightenment\"), and Judith Butler (\"Antigone's Claim\").This course is taught in English, and no previous knowledge of German is required.  Assignments include a mid-term writing task, a final term paper, and a group assignment of a theatre script / scene production.",
      "subject_code": "GERM",
      "course_number": "303",
      "section_number": "001",
      "building": "",
      "room": "",
      "instructors": [
        "30",
        "0",
        "30",
        "0"
      ],
      "totalRemaining": "",
      "currentlyRegistered": "",
      "generalRemaining": "",
      "restrictedRemaining": ""
    },
    {
      "status": "Full",
      "section": "GERM 303 002",
      "href": "/cs/courseschedule?pname=subjarea&tname=subj-section&dept=GERM&course=303&section=002&sessyr=2020&sesscd=W",
      "activity": "Web-Oriented Course",
      "term": "2",
      "interval": "",
      "days": [
        "TUE",
        "THU"
      ],
      "start": "11:00",
      "end": "12:30",
      "comments": "Stranger Things: Chess-playing automata, floating tables, walking statues, speaking dolls: this survey course proposes a cultural history of \"animation\" from 1700 to 1900. Long before the age of cinematography, \"animation\" was an established topic in theology and aesthetics, as well as an object of technological experiments and public attractions (magic lantern shows, phantasmagorias etc.). In the 19th century, new developments in economic philosophy and the social sciences complicate this picture, as the circulation of seemingly autonomous objects and \u0018natural\u0019 bodies become associated with terrifying visions. Via a series of literary texts, musical compositions, legal records, films and visual documents, we will examine the ways in which German writers and artists negotiated these dis and ~courses on the borderline between the biological and the mechanical, the familiar and the spectacular. This course will be taught asynchronously online.",
      "subject_code": "GERM",
      "course_number": "303",
      "section_number": "002",
      "building": " ",
      "room": "",
      "instructors": [
        "IURASCU, ILINCA"
      ],
      "totalRemaining": "0",
      "currentlyRegistered": "45",
      "generalRemaining": "0",
      "restrictedRemaining": "0"
    }
  ],
  "credits": 3,
  "description": "Reading and discussion of translated works from the German-speaking countries from the Middle Ages to 1900.",
  "terms": [
    "1",
    "2"
  ],
  "activities": [
    "Web-Oriented Course"
  ]
}
